apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_ADC_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_ADC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* ADC Register Offsets *****************************************************/

#define S32K3XX_ADC_MCR_OFFSET            (0x0000) /* Main Configuration Register (MCR) */
#define S32K3XX_ADC_MSR_OFFSET            (0x0004) /* Main Status Register (MSR) */
#define S32K3XX_ADC_ISR_OFFSET            (0x0010) /* Interrupt Status Register (ISR) */
#define S32K3XX_ADC_CEOCFR0_OFFSET        (0x0014) /* Channel End Of Conversation Flag Register for Precision Inputs (CEOCFR0) */
#define S32K3XX_ADC_CEOCFR1_OFFSET        (0x0018) /* Channel End Of Conversation Flag Register for Standard Inputs (CEOCFR1) */
#define S32K3XX_ADC_CEOCFR2_OFFSET        (0x001c) /* Channel End Of Conversation Flag Register for External Inputs (CEOCFR2) */
#define S32K3XX_ADC_IMR_OFFSET            (0x0020) /* Interrupt Mask Register (IMR) */
#define S32K3XX_ADC_CIMR0_OFFSET          (0x0024) /* EOC Interrupt Enable Register for Precision Inputs (CIMR0) */
#define S32K3XX_ADC_CIMR1_OFFSET          (0x0028) /* EOC Interrupt Enable Register for Standard Inputs (CIMR1) */
#define S32K3XX_ADC_CIMR2_OFFSET          (0x002c) /* EOC Interrupt Enable Register for External Inputs (CIMR2) */
#define S32K3XX_ADC_WTISR_OFFSET          (0x0030) /* Analog Watchdog Threshold Interrupt Status Register (WTISR) */
#define S32K3XX_ADC_WTIMR_OFFSET          (0x0034) /* Analog Watchdog Threshold Interrupt Enable Register (WTIMR) */
#define S32K3XX_ADC_DMAE_OFFSET           (0x0040) /* Direct Memory Access Configuration Register (DMAE) */
#define S32K3XX_ADC_DMAR0_OFFSET          (0x0044) /* DMA Request Enable Register for Precision Inputs (DMAR0) */
#define S32K3XX_ADC_DMAR1_OFFSET          (0x0048) /* DMA Request Enable Register for Standard Inputs (DMAR1) */
#define S32K3XX_ADC_DMAR2_OFFSET          (0x004c) /* DMA Request Enable Register for External Inputs (DMAR2) */
#define S32K3XX_ADC_THRHLR0_OFFSET        (0x0060) /* Analog Watchdog Threshold Values Register 0 (THRHLR0) */
#define S32K3XX_ADC_THRHLR1_OFFSET        (0x0064) /* Analog Watchdog Threshold Values Register 1 (THRHLR1) */
#define S32K3XX_ADC_THRHLR2_OFFSET        (0x0068) /* Analog Watchdog Threshold Values Register 2 (THRHLR2) */
#define S32K3XX_ADC_THRHLR3_OFFSET        (0x006c) /* Analog Watchdog Threshold Values Register 3 (THRHLR3) */
#define S32K3XX_ADC_PSCR_OFFSET           (0x0080) /* Presampling Control Register (PSCR) */
#define S32K3XX_ADC_PSR0_OFFSET           (0x0084) /* Presampling Enable Register for Precision Inputs (PSR0) */
#define S32K3XX_ADC_PSR1_OFFSET           (0x0088) /* Presampling Enable Register for Standard Inputs (PSR1) */
#define S32K3XX_ADC_PSR2_OFFSET           (0x008c) /* Presampling Enable Register for External Inputs (PSR2) */
#define S32K3XX_ADC_CTR0_OFFSET           (0x0094) /* Conversion Timing Register for Precision Inputs (CTR0) */
#define S32K3XX_ADC_CTR1_OFFSET           (0x0098) /* Conversion Timing Register for Standard Inputs (CTR1) */
#define S32K3XX_ADC_CTR2_OFFSET           (0x009c) /* Conversion Timing Register for External Inputs (CTR2) */
#define S32K3XX_ADC_NCMR0_OFFSET          (0x00a4) /* Normal Conversion Enable Register for Precision Inputs (NCMR0) */
#define S32K3XX_ADC_NCMR1_OFFSET          (0x00a8) /* Normal Conversion Enable Register for Standard Inputs (NCMR1) */
#define S32K3XX_ADC_NCMR2_OFFSET          (0x00ac) /* Normal Conversion Enable Register for External Inputs (NCMR2) */
#define S32K3XX_ADC_JCMR0_OFFSET          (0x00b4) /* Injected Conversion Enable Register for Precision Inputs (JCMR0) */
#define S32K3XX_ADC_JCMR1_OFFSET          (0x00b8) /* Injected Conversion Enable Register for Standard Inputs (JCMR1) */
#define S32K3XX_ADC_JCMR2_OFFSET          (0x00bc) /* Injected Conversion Enable Register for External Inputs (JCMR2) */
#define S32K3XX_ADC_DSDR_OFFSET           (0x00c4) /* Delay Start of Data Conversion Register (DSDR) */
#define S32K3XX_ADC_PDEDR_OFFSET          (0x00c8) /* Power Down Exit Delay Register (PDEDR) */

#define S32K3XX_ADC_PCDR_OFFSET(n)        (0x0100 + ((n) << 2))
#define S32K3XX_ADC_PCDR0_OFFSET          (0x0100) /* Precision Input 0 Conversion Data Register (PCDR0) */
#define S32K3XX_ADC_PCDR1_OFFSET          (0x0104) /* Precision Input 1 Conversion Data Register (PCDR1) */
#define S32K3XX_ADC_PCDR2_OFFSET          (0x0108) /* Precision Input 2 Conversion Data Register (PCDR2) */
#define S32K3XX_ADC_PCDR3_OFFSET          (0x010c) /* Precision Input 3 Conversion Data Register (PCDR3) */
#define S32K3XX_ADC_PCDR4_OFFSET          (0x0110) /* Precision Input 4 Conversion Data Register (PCDR4) */
#define S32K3XX_ADC_PCDR5_OFFSET          (0x0114) /* Precision Input 5 Conversion Data Register (PCDR5) */
#define S32K3XX_ADC_PCDR6_OFFSET          (0x0118) /* Precision Input 6 Conversion Data Register (PCDR6) */
#define S32K3XX_ADC_PCDR7_OFFSET          (0x011c) /* Precision Input 7 Conversion Data Register (PCDR7) */

#define S32K3XX_ADC_ICDR_OFFSET(n)        (0x0180 + ((n) << 2))
#define S32K3XX_ADC_ICDR0_OFFSET          (0x0180) /* Standard Input 0 Conversion Data Register (ICDR0) */
#define S32K3XX_ADC_ICDR1_OFFSET          (0x0184) /* Standard Input 1 Conversion Data Register (ICDR1) */
#define S32K3XX_ADC_ICDR2_OFFSET          (0x0188) /* Standard Input 2 Conversion Data Register (ICDR2) */
#define S32K3XX_ADC_ICDR3_OFFSET          (0x018c) /* Standard Input 3 Conversion Data Register (ICDR3) */
#define S32K3XX_ADC_ICDR4_OFFSET          (0x0190) /* Standard Input 4 Conversion Data Register (ICDR4) */
#define S32K3XX_ADC_ICDR5_OFFSET          (0x0194) /* Standard Input 5 Conversion Data Register (ICDR5) */
#define S32K3XX_ADC_ICDR6_OFFSET          (0x0198) /* Standard Input 6 Conversion Data Register (ICDR6) */
#define S32K3XX_ADC_ICDR7_OFFSET          (0x019c) /* Standard Input 7 Conversion Data Register (ICDR7) */
#define S32K3XX_ADC_ICDR8_OFFSET          (0x01a0) /* Standard Input 8 Conversion Data Register (ICDR8) */
#define S32K3XX_ADC_ICDR9_OFFSET          (0x01a4) /* Standard Input 9 Conversion Data Register (ICDR9) */
#define S32K3XX_ADC_ICDR10_OFFSET         (0x01a8) /* Standard Input 10 Conversion Data Register (ICDR10) */
#define S32K3XX_ADC_ICDR11_OFFSET         (0x01ac) /* Standard Input 11 Conversion Data Register (ICDR11) */
#define S32K3XX_ADC_ICDR12_OFFSET         (0x01b0) /* Standard Input 12 Conversion Data Register (ICDR12) */
#define S32K3XX_ADC_ICDR13_OFFSET         (0x01b4) /* Standard Input 13 Conversion Data Register (ICDR13) */
#define S32K3XX_ADC_ICDR14_OFFSET         (0x01b8) /* Standard Input 14 Conversion Data Register (ICDR14) */
#define S32K3XX_ADC_ICDR15_OFFSET         (0x01bc) /* Standard Input 15 Conversion Data Register (ICDR15) */
#define S32K3XX_ADC_ICDR16_OFFSET         (0x01c0) /* Standard Input 16 Conversion Data Register (ICDR16) */
#define S32K3XX_ADC_ICDR17_OFFSET         (0x01c4) /* Standard Input 17 Conversion Data Register (ICDR17) */
#define S32K3XX_ADC_ICDR18_OFFSET         (0x01c8) /* Standard Input 18 Conversion Data Register (ICDR18) */
#define S32K3XX_ADC_ICDR19_OFFSET         (0x01cc) /* Standard Input 19 Conversion Data Register (ICDR19) */
#define S32K3XX_ADC_ICDR20_OFFSET         (0x01d0) /* Standard Input 20 Conversion Data Register (ICDR20) */
#define S32K3XX_ADC_ICDR21_OFFSET         (0x01d4) /* Standard Input 21 Conversion Data Register (ICDR21) */
#define S32K3XX_ADC_ICDR22_OFFSET         (0x01d8) /* Standard Input 22 Conversion Data Register (ICDR22) */
#define S32K3XX_ADC_ICDR23_OFFSET         (0x01dc) /* Standard Input 23 Conversion Data Register (ICDR23) */

