apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define S32K3XX_ADC_ECDR_OFFSET(n)        (0x0200 + ((n) << 2))
#define S32K3XX_ADC_ECDR0_OFFSET          (0x0200) /* External Input 0 Conversion Data Register (ECDR0) */
#define S32K3XX_ADC_ECDR1_OFFSET          (0x0204) /* External Input 1 Conversion Data Register (ECDR1) */
#define S32K3XX_ADC_ECDR2_OFFSET          (0x0208) /* External Input 2 Conversion Data Register (ECDR2) */
#define S32K3XX_ADC_ECDR3_OFFSET          (0x020c) /* External Input 3 Conversion Data Register (ECDR3) */
#define S32K3XX_ADC_ECDR4_OFFSET          (0x0210) /* External Input 4 Conversion Data Register (ECDR4) */
#define S32K3XX_ADC_ECDR5_OFFSET          (0x0214) /* External Input 5 Conversion Data Register (ECDR5) */
#define S32K3XX_ADC_ECDR6_OFFSET          (0x0218) /* External Input 6 Conversion Data Register (ECDR6) */
#define S32K3XX_ADC_ECDR7_OFFSET          (0x021c) /* External Input 7 Conversion Data Register (ECDR7) */
#define S32K3XX_ADC_ECDR8_OFFSET          (0x0220) /* External Input 8 Conversion Data Register (ECDR8) */
#define S32K3XX_ADC_ECDR9_OFFSET          (0x0224) /* External Input 9 Conversion Data Register (ECDR9) */
#define S32K3XX_ADC_ECDR10_OFFSET         (0x0228) /* External Input 10 Conversion Data Register (ECDR10) */
#define S32K3XX_ADC_ECDR11_OFFSET         (0x022c) /* External Input 11 Conversion Data Register (ECDR11) */
#define S32K3XX_ADC_ECDR12_OFFSET         (0x0230) /* External Input 12 Conversion Data Register (ECDR12) */
#define S32K3XX_ADC_ECDR13_OFFSET         (0x0234) /* External Input 13 Conversion Data Register (ECDR13) */
#define S32K3XX_ADC_ECDR14_OFFSET         (0x0238) /* External Input 14 Conversion Data Register (ECDR14) */
#define S32K3XX_ADC_ECDR15_OFFSET         (0x023c) /* External Input 15 Conversion Data Register (ECDR15) */
#define S32K3XX_ADC_ECDR16_OFFSET         (0x0240) /* External Input 16 Conversion Data Register (ECDR16) */
#define S32K3XX_ADC_ECDR17_OFFSET         (0x0244) /* External Input 17 Conversion Data Register (ECDR17) */
#define S32K3XX_ADC_ECDR18_OFFSET         (0x0248) /* External Input 18 Conversion Data Register (ECDR18) */
#define S32K3XX_ADC_ECDR19_OFFSET         (0x024c) /* External Input 19 Conversion Data Register (ECDR19) */
#define S32K3XX_ADC_ECDR20_OFFSET         (0x0250) /* External Input 20 Conversion Data Register (ECDR20) */
#define S32K3XX_ADC_ECDR21_OFFSET         (0x0254) /* External Input 21 Conversion Data Register (ECDR21) */
#define S32K3XX_ADC_ECDR22_OFFSET         (0x0258) /* External Input 22 Conversion Data Register (ECDR22) */
#define S32K3XX_ADC_ECDR23_OFFSET         (0x025c) /* External Input 23 Conversion Data Register (ECDR23) */
#define S32K3XX_ADC_ECDR24_OFFSET         (0x0260) /* External Input 24 Conversion Data Register (ECDR24) */
#define S32K3XX_ADC_ECDR25_OFFSET         (0x0264) /* External Input 25 Conversion Data Register (ECDR25) */
#define S32K3XX_ADC_ECDR26_OFFSET         (0x0268) /* External Input 26 Conversion Data Register (ECDR26) */
#define S32K3XX_ADC_ECDR27_OFFSET         (0x026c) /* External Input 27 Conversion Data Register (ECDR27) */
#define S32K3XX_ADC_ECDR28_OFFSET         (0x0270) /* External Input 28 Conversion Data Register (ECDR28) */
#define S32K3XX_ADC_ECDR29_OFFSET         (0x0274) /* External Input 29 Conversion Data Register (ECDR29) */
#define S32K3XX_ADC_ECDR30_OFFSET         (0x0278) /* External Input 30 Conversion Data Register (ECDR30) */
#define S32K3XX_ADC_ECDR31_OFFSET         (0x027c) /* External Input 31 Conversion Data Register (ECDR31) */

#define S32K3XX_ADC_CWSELRPI0_OFFSET      (0x02b0) /* Channel Analog Watchdog Select Register for Precision Inputs 0 (CWSELRPI0) */
#define S32K3XX_ADC_CWSELRPI1_OFFSET      (0x02b4) /* Channel Analog Watchdog Select Register for Precision Inputs 1 (CWSELRPI1) */
#define S32K3XX_ADC_CWSELRSI0_OFFSET      (0x02c0) /* Channel Analog Watchdog Select Register for Standard Inputs 0 (CWSELRSI0) */
#define S32K3XX_ADC_CWSELRSI1_OFFSET      (0x02c4) /* Channel Analog Watchdog Select Register for Standard Inputs 1 (CWSELRSI1) */
#define S32K3XX_ADC_CWSELRSI2_OFFSET      (0x02c8) /* Channel Analog Watchdog Select Register for Standard Inputs 2 (CWSELRSI2) */
#define S32K3XX_ADC_CWSELREI0_OFFSET      (0x02d0) /* Channel Analog Watchdog Select Register for External Inputs 0 (CWSELREI0) */
#define S32K3XX_ADC_CWSELREI1_OFFSET      (0x02d4) /* Channel Analog Watchdog Select Register for External Inputs 1 (CWSELREI1) */
#define S32K3XX_ADC_CWSELREI2_OFFSET      (0x02d8) /* Channel Analog Watchdog Select Register for External Inputs 2 (CWSELREI2) */
#define S32K3XX_ADC_CWSELREI3_OFFSET      (0x02dc) /* Channel Analog Watchdog Select Register for External Inputs 3 (CWSELREI3) */
#define S32K3XX_ADC_CWENR0_OFFSET         (0x02e0) /* Channel Watchdog Enable Register for Precision Inputs (CWENR0) */
#define S32K3XX_ADC_CWENR1_OFFSET         (0x02e4) /* Channel Watchdog Enable Register for Standard Inputs (CWENR1) */
#define S32K3XX_ADC_CWENR2_OFFSET         (0x02e8) /* Channel Watchdog Enable Register for External Inputs (CWENR2) */
#define S32K3XX_ADC_AWORR0_OFFSET         (0x02f0) /* Analog Watchdog Out of Range Register for Precision Inputs (AWORR0) */
#define S32K3XX_ADC_AWORR1_OFFSET         (0x02f4) /* Analog Watchdog Out of Range Register for Standard Inputs (AWORR1) */
#define S32K3XX_ADC_AWORR2_OFFSET         (0x02f8) /* Analog Watchdog Out of Range Register for External Inputs (AWORR2) */
#define S32K3XX_ADC_STCR1_OFFSET          (0x0340) /* Self-Test Configuration Register 1 (STCR1) */
#define S32K3XX_ADC_STCR2_OFFSET          (0x0344) /* Self-Test Configuration Register 2 (STCR2) */
#define S32K3XX_ADC_STCR3_OFFSET          (0x0348) /* Self-Test Configuration Register 3 (STCR3) */
#define S32K3XX_ADC_STBRR_OFFSET          (0x034c) /* Self-Test Baud Rate Register (STBRR) */
#define S32K3XX_ADC_STSR1_OFFSET          (0x0350) /* Self-Test Status Register 1 (STSR1) */
#define S32K3XX_ADC_STSR2_OFFSET          (0x0354) /* Self-Test Status Register 2 (STSR2) */
#define S32K3XX_ADC_STSR3_OFFSET          (0x0358) /* Self-Test Status Register 3 (STSR3) */
#define S32K3XX_ADC_STSR4_OFFSET          (0x035c) /* Self-Test Status Register 4 (STSR4) */
#define S32K3XX_ADC_STDR1_OFFSET          (0x0370) /* Self-Test Conversion Data Register 1 (STDR1) */
#define S32K3XX_ADC_STAW0R_OFFSET         (0x0380) /* Self-Test Analog Watchdog S0 Register (STAW0R) */
#define S32K3XX_ADC_STAW1R_OFFSET         (0x0388) /* Self-Test Analog Watchdog S1 Register (STAW1R) */
#define S32K3XX_ADC_STAW2R_OFFSET         (0x038c) /* Self-Test Analog Watchdog S2 Register (STAW2R) */
#define S32K3XX_ADC_STAW4R_OFFSET         (0x0394) /* Self-Test Analog Watchdog C0 Register (STAW4R) */
#define S32K3XX_ADC_STAW5R_OFFSET         (0x0398) /* Self-Test Analog Watchdog C Register (STAW5R) */
#define S32K3XX_ADC_AMSIO_OFFSET          (0x039c) /* Analog Miscellaneous In/Out Register (AMSIO) */ 
#define S32K3XX_ADC_CALBISTREG_OFFSET     (0x03a0) /* Control and Calibration Status Register (CALBISTREG) */
#define S32K3XX_ADC_OFSGNUSR_OFFSET       (0x03a8) /* Offset and Gain User Register (OFSGNUSR) */
#define S32K3XX_ADC_CAL2_OFFSET           (0x03b4) /* Calibration Value 2 (CAL2) */

/* ADC Register Addresses ***************************************************/

/* ADC0 */

#define S32K3XX_ADC0_MCR                  (S32K3XX_ADC0_BASE + S32K3XX_ADC_MCR_OFFSET)
#define S32K3XX_ADC0_MSR                  (S32K3XX_ADC0_BASE + S32K3XX_ADC_MSR_OFFSET)
#define S32K3XX_ADC0_ISR                  (S32K3XX_ADC0_BASE + S32K3XX_ADC_ISR_OFFSET)
#define S32K3XX_ADC0_CEOCFR0              (S32K3XX_ADC0_BASE + S32K3XX_ADC_CEOCFR0_OFFSET)
#define S32K3XX_ADC0_CEOCFR1              (S32K3XX_ADC0_BASE + S32K3XX_ADC_CEOCFR1_OFFSET)
#define S32K3XX_ADC0_CEOCFR2              (S32K3XX_ADC0_BASE + S32K3XX_ADC_CEOCFR2_OFFSET)
#define S32K3XX_ADC0_IMR                  (S32K3XX_ADC0_BASE + S32K3XX_ADC_IMR_OFFSET)
#define S32K3XX_ADC0_CIMR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_CIMR0_OFFSET)
#define S32K3XX_ADC0_CIMR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_CIMR1_OFFSET)
#define S32K3XX_ADC0_CIMR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_CIMR2_OFFSET)
#define S32K3XX_ADC0_WTISR                (S32K3XX_ADC0_BASE + S32K3XX_ADC_WTISR_OFFSET)
#define S32K3XX_ADC0_WTIMR                (S32K3XX_ADC0_BASE + S32K3XX_ADC_WTIMR_OFFSET)
#define S32K3XX_ADC0_DMAE                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_DMAE_OFFSET)
#define S32K3XX_ADC0_DMAR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_DMAR0_OFFSET)
#define S32K3XX_ADC0_DMAR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_DMAR1_OFFSET)
#define S32K3XX_ADC0_DMAR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_DMAR2_OFFSET)
#define S32K3XX_ADC0_THRHLR0              (S32K3XX_ADC0_BASE + S32K3XX_ADC_THRHLR0_OFFSET)
#define S32K3XX_ADC0_THRHLR1              (S32K3XX_ADC0_BASE + S32K3XX_ADC_THRHLR1_OFFSET)
#define S32K3XX_ADC0_THRHLR2              (S32K3XX_ADC0_BASE + S32K3XX_ADC_THRHLR2_OFFSET)
#define S32K3XX_ADC0_THRHLR3              (S32K3XX_ADC0_BASE + S32K3XX_ADC_THRHLR3_OFFSET)
#define S32K3XX_ADC0_PSCR                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_PSCR_OFFSET)
#define S32K3XX_ADC0_PSR0                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_PSR0_OFFSET)
#define S32K3XX_ADC0_PSR1                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_PSR1_OFFSET)
#define S32K3XX_ADC0_PSR2                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_PSR2_OFFSET)
#define S32K3XX_ADC0_CTR0                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_CTR0_OFFSET)
#define S32K3XX_ADC0_CTR1                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_CTR1_OFFSET)
#define S32K3XX_ADC0_CTR2                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_CTR2_OFFSET)
#define S32K3XX_ADC0_NCMR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_NCMR0_OFFSET)
#define S32K3XX_ADC0_NCMR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_NCMR1_OFFSET)
#define S32K3XX_ADC0_NCMR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_NCMR2_OFFSET)
#define S32K3XX_ADC0_JCMR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_JCMR0_OFFSET)
#define S32K3XX_ADC0_JCMR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_JCMR1_OFFSET)
#define S32K3XX_ADC0_JCMR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_JCMR2_OFFSET)
#define S32K3XX_ADC0_DSDR                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_DSDR_OFFSET)
#define S32K3XX_ADC0_PDEDR                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PDEDR_OFFSET)

