apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define S32K3XX_ADC0_PCDR(n)              (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR_OFFSET(n))
#define S32K3XX_ADC0_PCDR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR0_OFFSET)
#define S32K3XX_ADC0_PCDR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR1_OFFSET)
#define S32K3XX_ADC0_PCDR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR2_OFFSET)
#define S32K3XX_ADC0_PCDR3                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR3_OFFSET)
#define S32K3XX_ADC0_PCDR4                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR4_OFFSET)
#define S32K3XX_ADC0_PCDR5                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR5_OFFSET)
#define S32K3XX_ADC0_PCDR6                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR6_OFFSET)
#define S32K3XX_ADC0_PCDR7                (S32K3XX_ADC0_BASE + S32K3XX_ADC_PCDR7_OFFSET)

#define S32K3XX_ADC0_ICDR(n)              (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR_OFFSET(n))
#define S32K3XX_ADC0_ICDR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR0_OFFSET)
#define S32K3XX_ADC0_ICDR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR1_OFFSET)
#define S32K3XX_ADC0_ICDR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR2_OFFSET)
#define S32K3XX_ADC0_ICDR3                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR3_OFFSET)
#define S32K3XX_ADC0_ICDR4                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR4_OFFSET)
#define S32K3XX_ADC0_ICDR5                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR5_OFFSET)
#define S32K3XX_ADC0_ICDR6                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR6_OFFSET)
#define S32K3XX_ADC0_ICDR7                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR7_OFFSET)
#define S32K3XX_ADC0_ICDR8                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR8_OFFSET)
#define S32K3XX_ADC0_ICDR9                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR9_OFFSET)
#define S32K3XX_ADC0_ICDR10               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR10_OFFSET)
#define S32K3XX_ADC0_ICDR11               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR11_OFFSET)
#define S32K3XX_ADC0_ICDR12               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR12_OFFSET)
#define S32K3XX_ADC0_ICDR13               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR13_OFFSET)
#define S32K3XX_ADC0_ICDR14               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR14_OFFSET)
#define S32K3XX_ADC0_ICDR15               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR15_OFFSET)
#define S32K3XX_ADC0_ICDR16               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR16_OFFSET)
#define S32K3XX_ADC0_ICDR17               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR17_OFFSET)
#define S32K3XX_ADC0_ICDR18               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR18_OFFSET)
#define S32K3XX_ADC0_ICDR19               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR19_OFFSET)
#define S32K3XX_ADC0_ICDR20               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR20_OFFSET)
#define S32K3XX_ADC0_ICDR21               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR21_OFFSET)
#define S32K3XX_ADC0_ICDR22               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR22_OFFSET)
#define S32K3XX_ADC0_ICDR23               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ICDR23_OFFSET)

#define S32K3XX_ADC0_ECDR(n)              (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR_OFFSET(n))
#define S32K3XX_ADC0_ECDR0                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR0_OFFSET)
#define S32K3XX_ADC0_ECDR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR1_OFFSET)
#define S32K3XX_ADC0_ECDR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR2_OFFSET)
#define S32K3XX_ADC0_ECDR3                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR3_OFFSET)
#define S32K3XX_ADC0_ECDR4                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR4_OFFSET)
#define S32K3XX_ADC0_ECDR5                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR5_OFFSET)
#define S32K3XX_ADC0_ECDR6                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR6_OFFSET)
#define S32K3XX_ADC0_ECDR7                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR7_OFFSET)
#define S32K3XX_ADC0_ECDR8                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR8_OFFSET)
#define S32K3XX_ADC0_ECDR9                (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR9_OFFSET)
#define S32K3XX_ADC0_ECDR10               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR10_OFFSET)
#define S32K3XX_ADC0_ECDR11               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR11_OFFSET)
#define S32K3XX_ADC0_ECDR12               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR12_OFFSET)
#define S32K3XX_ADC0_ECDR13               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR13_OFFSET)
#define S32K3XX_ADC0_ECDR14               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR14_OFFSET)
#define S32K3XX_ADC0_ECDR15               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR15_OFFSET)
#define S32K3XX_ADC0_ECDR16               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR16_OFFSET)
#define S32K3XX_ADC0_ECDR17               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR17_OFFSET)
#define S32K3XX_ADC0_ECDR18               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR18_OFFSET)
#define S32K3XX_ADC0_ECDR19               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR19_OFFSET)
#define S32K3XX_ADC0_ECDR20               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR20_OFFSET)
#define S32K3XX_ADC0_ECDR21               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR21_OFFSET)
#define S32K3XX_ADC0_ECDR22               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR22_OFFSET)
#define S32K3XX_ADC0_ECDR23               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR23_OFFSET)
#define S32K3XX_ADC0_ECDR24               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR24_OFFSET)
#define S32K3XX_ADC0_ECDR25               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR25_OFFSET)
#define S32K3XX_ADC0_ECDR26               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR26_OFFSET)
#define S32K3XX_ADC0_ECDR27               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR27_OFFSET)
#define S32K3XX_ADC0_ECDR28               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR28_OFFSET)
#define S32K3XX_ADC0_ECDR29               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR29_OFFSET)
#define S32K3XX_ADC0_ECDR30               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR30_OFFSET)
#define S32K3XX_ADC0_ECDR31               (S32K3XX_ADC0_BASE + S32K3XX_ADC_ECDR31_OFFSET)

#define S32K3XX_ADC0_CWSELRPI0            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELRPI0_OFFSET)
#define S32K3XX_ADC0_CWSELRPI1            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELRPI1_OFFSET)
#define S32K3XX_ADC0_CWSELRSI0            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELRSI0_OFFSET)
#define S32K3XX_ADC0_CWSELRSI1            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELRSI1_OFFSET)
#define S32K3XX_ADC0_CWSELRSI2            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELRSI2_OFFSET)
#define S32K3XX_ADC0_CWSELREI0            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELREI0_OFFSET)
#define S32K3XX_ADC0_CWSELREI1            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELREI1_OFFSET)
#define S32K3XX_ADC0_CWSELREI2            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELREI2_OFFSET)
#define S32K3XX_ADC0_CWSELREI3            (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWSELREI3_OFFSET)
#define S32K3XX_ADC0_CWENR0               (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWENR0_OFFSET)
#define S32K3XX_ADC0_CWENR1               (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWENR1_OFFSET)
#define S32K3XX_ADC0_CWENR2               (S32K3XX_ADC0_BASE + S32K3XX_ADC_CWENR2_OFFSET)
#define S32K3XX_ADC0_AWORR0               (S32K3XX_ADC0_BASE + S32K3XX_ADC_AWORR0_OFFSET)
#define S32K3XX_ADC0_AWORR1               (S32K3XX_ADC0_BASE + S32K3XX_ADC_AWORR1_OFFSET)
#define S32K3XX_ADC0_AWORR2               (S32K3XX_ADC0_BASE + S32K3XX_ADC_AWORR2_OFFSET)
#define S32K3XX_ADC0_STCR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STCR1_OFFSET)
#define S32K3XX_ADC0_STCR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STCR2_OFFSET)
#define S32K3XX_ADC0_STCR3                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STCR3_OFFSET)
#define S32K3XX_ADC0_STBRR                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STBRR_OFFSET)
#define S32K3XX_ADC0_STSR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STSR1_OFFSET)
#define S32K3XX_ADC0_STSR2                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STSR2_OFFSET)
#define S32K3XX_ADC0_STSR3                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STSR3_OFFSET)
#define S32K3XX_ADC0_STSR4                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STSR4_OFFSET)
#define S32K3XX_ADC0_STDR1                (S32K3XX_ADC0_BASE + S32K3XX_ADC_STDR1_OFFSET)
#define S32K3XX_ADC0_STAW0R               (S32K3XX_ADC0_BASE + S32K3XX_ADC_STAW0R_OFFSET)
#define S32K3XX_ADC0_STAW1R               (S32K3XX_ADC0_BASE + S32K3XX_ADC_STAW1R_OFFSET)
#define S32K3XX_ADC0_STAW2R               (S32K3XX_ADC0_BASE + S32K3XX_ADC_STAW2R_OFFSET)
#define S32K3XX_ADC0_STAW4R               (S32K3XX_ADC0_BASE + S32K3XX_ADC_STAW4R_OFFSET)
#define S32K3XX_ADC0_STAW5R               (S32K3XX_ADC0_BASE + S32K3XX_ADC_STAW5R_OFFSET)
#define S32K3XX_ADC0_AMSIO                (S32K3XX_ADC0_BASE + S32K3XX_ADC_AMSIO_OFFSET )
#define S32K3XX_ADC0_CALBISTREG           (S32K3XX_ADC0_BASE + S32K3XX_ADC_CALBISTREG_OFFSET)
#define S32K3XX_ADC0_OFSGNUSR             (S32K3XX_ADC0_BASE + S32K3XX_ADC_OFSGNUSR_OFFSET)
#define S32K3XX_ADC0_CAL2                 (S32K3XX_ADC0_BASE + S32K3XX_ADC_CAL2_OFFSET)

/* ADC1 */

#define S32K3XX_ADC1_MCR                  (S32K3XX_ADC1_BASE + S32K3XX_ADC_MCR_OFFSET)
#define S32K3XX_ADC1_MSR                  (S32K3XX_ADC1_BASE + S32K3XX_ADC_MSR_OFFSET)
#define S32K3XX_ADC1_ISR                  (S32K3XX_ADC1_BASE + S32K3XX_ADC_ISR_OFFSET)
#define S32K3XX_ADC1_CEOCFR0              (S32K3XX_ADC1_BASE + S32K3XX_ADC_CEOCFR0_OFFSET)
#define S32K3XX_ADC1_CEOCFR1              (S32K3XX_ADC1_BASE + S32K3XX_ADC_CEOCFR1_OFFSET)
#define S32K3XX_ADC1_CEOCFR2              (S32K3XX_ADC1_BASE + S32K3XX_ADC_CEOCFR2_OFFSET)
#define S32K3XX_ADC1_IMR                  (S32K3XX_ADC1_BASE + S32K3XX_ADC_IMR_OFFSET)
#define S32K3XX_ADC1_CIMR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_CIMR0_OFFSET)
#define S32K3XX_ADC1_CIMR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_CIMR1_OFFSET)
#define S32K3XX_ADC1_CIMR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_CIMR2_OFFSET)
#define S32K3XX_ADC1_WTISR                (S32K3XX_ADC1_BASE + S32K3XX_ADC_WTISR_OFFSET)
#define S32K3XX_ADC1_WTIMR                (S32K3XX_ADC1_BASE + S32K3XX_ADC_WTIMR_OFFSET)
#define S32K3XX_ADC1_DMAE                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_DMAE_OFFSET)
#define S32K3XX_ADC1_DMAR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_DMAR0_OFFSET)
#define S32K3XX_ADC1_DMAR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_DMAR1_OFFSET)
#define S32K3XX_ADC1_DMAR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_DMAR2_OFFSET)
#define S32K3XX_ADC1_THRHLR0              (S32K3XX_ADC1_BASE + S32K3XX_ADC_THRHLR0_OFFSET)
#define S32K3XX_ADC1_THRHLR1              (S32K3XX_ADC1_BASE + S32K3XX_ADC_THRHLR1_OFFSET)
#define S32K3XX_ADC1_THRHLR2              (S32K3XX_ADC1_BASE + S32K3XX_ADC_THRHLR2_OFFSET)
#define S32K3XX_ADC1_THRHLR3              (S32K3XX_ADC1_BASE + S32K3XX_ADC_THRHLR3_OFFSET)
#define S32K3XX_ADC1_PSCR                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_PSCR_OFFSET)
#define S32K3XX_ADC1_PSR0                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_PSR0_OFFSET)
#define S32K3XX_ADC1_PSR1                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_PSR1_OFFSET)
#define S32K3XX_ADC1_PSR2                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_PSR2_OFFSET)
#define S32K3XX_ADC1_CTR0                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_CTR0_OFFSET)
#define S32K3XX_ADC1_CTR1                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_CTR1_OFFSET)
#define S32K3XX_ADC1_CTR2                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_CTR2_OFFSET)
#define S32K3XX_ADC1_NCMR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_NCMR0_OFFSET)
#define S32K3XX_ADC1_NCMR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_NCMR1_OFFSET)
#define S32K3XX_ADC1_NCMR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_NCMR2_OFFSET)
#define S32K3XX_ADC1_JCMR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_JCMR0_OFFSET)
#define S32K3XX_ADC1_JCMR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_JCMR1_OFFSET)
#define S32K3XX_ADC1_JCMR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_JCMR2_OFFSET)
#define S32K3XX_ADC1_DSDR                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_DSDR_OFFSET)
#define S32K3XX_ADC1_PDEDR                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PDEDR_OFFSET)

#define S32K3XX_ADC1_PCDR(n)              (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR_OFFSET(n))
#define S32K3XX_ADC1_PCDR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR0_OFFSET)
#define S32K3XX_ADC1_PCDR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR1_OFFSET)
#define S32K3XX_ADC1_PCDR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR2_OFFSET)
#define S32K3XX_ADC1_PCDR3                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR3_OFFSET)
#define S32K3XX_ADC1_PCDR4                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR4_OFFSET)
#define S32K3XX_ADC1_PCDR5                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR5_OFFSET)
#define S32K3XX_ADC1_PCDR6                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR6_OFFSET)
#define S32K3XX_ADC1_PCDR7                (S32K3XX_ADC1_BASE + S32K3XX_ADC_PCDR7_OFFSET)

#define S32K3XX_ADC1_ICDR(n)              (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR_OFFSET(n))
#define S32K3XX_ADC1_ICDR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR0_OFFSET)
#define S32K3XX_ADC1_ICDR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR1_OFFSET)
#define S32K3XX_ADC1_ICDR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR2_OFFSET)
#define S32K3XX_ADC1_ICDR3                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR3_OFFSET)
#define S32K3XX_ADC1_ICDR4                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR4_OFFSET)
#define S32K3XX_ADC1_ICDR5                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR5_OFFSET)
#define S32K3XX_ADC1_ICDR6                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR6_OFFSET)
#define S32K3XX_ADC1_ICDR7                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR7_OFFSET)
#define S32K3XX_ADC1_ICDR8                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR8_OFFSET)
#define S32K3XX_ADC1_ICDR9                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR9_OFFSET)
#define S32K3XX_ADC1_ICDR10               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR10_OFFSET)
#define S32K3XX_ADC1_ICDR11               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR11_OFFSET)
#define S32K3XX_ADC1_ICDR12               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR12_OFFSET)
#define S32K3XX_ADC1_ICDR13               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR13_OFFSET)
#define S32K3XX_ADC1_ICDR14               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR14_OFFSET)
#define S32K3XX_ADC1_ICDR15               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR15_OFFSET)
#define S32K3XX_ADC1_ICDR16               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR16_OFFSET)
#define S32K3XX_ADC1_ICDR17               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR17_OFFSET)
#define S32K3XX_ADC1_ICDR18               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR18_OFFSET)
#define S32K3XX_ADC1_ICDR19               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR19_OFFSET)
#define S32K3XX_ADC1_ICDR20               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR20_OFFSET)
#define S32K3XX_ADC1_ICDR21               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR21_OFFSET)
#define S32K3XX_ADC1_ICDR22               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR22_OFFSET)
#define S32K3XX_ADC1_ICDR23               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ICDR23_OFFSET)

#define S32K3XX_ADC1_ECDR(n)              (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR_OFFSET(n))
#define S32K3XX_ADC1_ECDR0                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR0_OFFSET)
#define S32K3XX_ADC1_ECDR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR1_OFFSET)
#define S32K3XX_ADC1_ECDR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR2_OFFSET)
#define S32K3XX_ADC1_ECDR3                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR3_OFFSET)
#define S32K3XX_ADC1_ECDR4                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR4_OFFSET)
#define S32K3XX_ADC1_ECDR5                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR5_OFFSET)
#define S32K3XX_ADC1_ECDR6                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR6_OFFSET)
#define S32K3XX_ADC1_ECDR7                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR7_OFFSET)
#define S32K3XX_ADC1_ECDR8                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR8_OFFSET)
#define S32K3XX_ADC1_ECDR9                (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR9_OFFSET)
#define S32K3XX_ADC1_ECDR10               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR10_OFFSET)
#define S32K3XX_ADC1_ECDR11               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR11_OFFSET)
#define S32K3XX_ADC1_ECDR12               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR12_OFFSET)
#define S32K3XX_ADC1_ECDR13               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR13_OFFSET)
#define S32K3XX_ADC1_ECDR14               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR14_OFFSET)
#define S32K3XX_ADC1_ECDR15               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR15_OFFSET)
#define S32K3XX_ADC1_ECDR16               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR16_OFFSET)
#define S32K3XX_ADC1_ECDR17               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR17_OFFSET)
#define S32K3XX_ADC1_ECDR18               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR18_OFFSET)
#define S32K3XX_ADC1_ECDR19               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR19_OFFSET)
#define S32K3XX_ADC1_ECDR20               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR20_OFFSET)
#define S32K3XX_ADC1_ECDR21               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR21_OFFSET)
#define S32K3XX_ADC1_ECDR22               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR22_OFFSET)
#define S32K3XX_ADC1_ECDR23               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR23_OFFSET)
#define S32K3XX_ADC1_ECDR24               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR24_OFFSET)
#define S32K3XX_ADC1_ECDR25               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR25_OFFSET)
#define S32K3XX_ADC1_ECDR26               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR26_OFFSET)
#define S32K3XX_ADC1_ECDR27               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR27_OFFSET)
#define S32K3XX_ADC1_ECDR28               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR28_OFFSET)
#define S32K3XX_ADC1_ECDR29               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR29_OFFSET)
#define S32K3XX_ADC1_ECDR30               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR30_OFFSET)
#define S32K3XX_ADC1_ECDR31               (S32K3XX_ADC1_BASE + S32K3XX_ADC_ECDR31_OFFSET)

#define S32K3XX_ADC1_CWSELRPI0            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELRPI0_OFFSET)
#define S32K3XX_ADC1_CWSELRPI1            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELRPI1_OFFSET)
#define S32K3XX_ADC1_CWSELRSI0            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELRSI0_OFFSET)
#define S32K3XX_ADC1_CWSELRSI1            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELRSI1_OFFSET)
#define S32K3XX_ADC1_CWSELRSI2            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELRSI2_OFFSET)
#define S32K3XX_ADC1_CWSELREI0            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELREI0_OFFSET)
#define S32K3XX_ADC1_CWSELREI1            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELREI1_OFFSET)
#define S32K3XX_ADC1_CWSELREI2            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELREI2_OFFSET)
#define S32K3XX_ADC1_CWSELREI3            (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWSELREI3_OFFSET)
#define S32K3XX_ADC1_CWENR0               (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWENR0_OFFSET)
#define S32K3XX_ADC1_CWENR1               (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWENR1_OFFSET)
#define S32K3XX_ADC1_CWENR2               (S32K3XX_ADC1_BASE + S32K3XX_ADC_CWENR2_OFFSET)
#define S32K3XX_ADC1_AWORR0               (S32K3XX_ADC1_BASE + S32K3XX_ADC_AWORR0_OFFSET)
#define S32K3XX_ADC1_AWORR1               (S32K3XX_ADC1_BASE + S32K3XX_ADC_AWORR1_OFFSET)
#define S32K3XX_ADC1_AWORR2               (S32K3XX_ADC1_BASE + S32K3XX_ADC_AWORR2_OFFSET)
#define S32K3XX_ADC1_STCR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STCR1_OFFSET)
#define S32K3XX_ADC1_STCR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STCR2_OFFSET)
#define S32K3XX_ADC1_STCR3                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STCR3_OFFSET)
#define S32K3XX_ADC1_STBRR                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STBRR_OFFSET)
#define S32K3XX_ADC1_STSR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STSR1_OFFSET)
#define S32K3XX_ADC1_STSR2                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STSR2_OFFSET)
#define S32K3XX_ADC1_STSR3                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STSR3_OFFSET)
#define S32K3XX_ADC1_STSR4                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STSR4_OFFSET)
#define S32K3XX_ADC1_STDR1                (S32K3XX_ADC1_BASE + S32K3XX_ADC_STDR1_OFFSET)
#define S32K3XX_ADC1_STAW0R               (S32K3XX_ADC1_BASE + S32K3XX_ADC_STAW0R_OFFSET)
#define S32K3XX_ADC1_STAW1R               (S32K3XX_ADC1_BASE + S32K3XX_ADC_STAW1R_OFFSET)
#define S32K3XX_ADC1_STAW2R               (S32K3XX_ADC1_BASE + S32K3XX_ADC_STAW2R_OFFSET)
#define S32K3XX_ADC1_STAW4R               (S32K3XX_ADC1_BASE + S32K3XX_ADC_STAW4R_OFFSET)
#define S32K3XX_ADC1_STAW5R               (S32K3XX_ADC1_BASE + S32K3XX_ADC_STAW5R_OFFSET)
#define S32K3XX_ADC1_AMSIO                (S32K3XX_ADC1_BASE + S32K3XX_ADC_AMSIO_OFFSET )
#define S32K3XX_ADC1_CALBISTREG           (S32K3XX_ADC1_BASE + S32K3XX_ADC_CALBISTREG_OFFSET)
#define S32K3XX_ADC1_OFSGNUSR             (S32K3XX_ADC1_BASE + S32K3XX_ADC_OFSGNUSR_OFFSET)
#define S32K3XX_ADC1_CAL2                 (S32K3XX_ADC1_BASE + S32K3XX_ADC_CAL2_OFFSET)

/* ADC2 */

