apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define S32K3XX_ADC2_MCR                  (S32K3XX_ADC2_BASE + S32K3XX_ADC_MCR_OFFSET)
#define S32K3XX_ADC2_MSR                  (S32K3XX_ADC2_BASE + S32K3XX_ADC_MSR_OFFSET)
#define S32K3XX_ADC2_ISR                  (S32K3XX_ADC2_BASE + S32K3XX_ADC_ISR_OFFSET)
#define S32K3XX_ADC2_CEOCFR0              (S32K3XX_ADC2_BASE + S32K3XX_ADC_CEOCFR0_OFFSET)
#define S32K3XX_ADC2_CEOCFR1              (S32K3XX_ADC2_BASE + S32K3XX_ADC_CEOCFR1_OFFSET)
#define S32K3XX_ADC2_CEOCFR2              (S32K3XX_ADC2_BASE + S32K3XX_ADC_CEOCFR2_OFFSET)
#define S32K3XX_ADC2_IMR                  (S32K3XX_ADC2_BASE + S32K3XX_ADC_IMR_OFFSET)
#define S32K3XX_ADC2_CIMR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_CIMR0_OFFSET)
#define S32K3XX_ADC2_CIMR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_CIMR1_OFFSET)
#define S32K3XX_ADC2_CIMR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_CIMR2_OFFSET)
#define S32K3XX_ADC2_WTISR                (S32K3XX_ADC2_BASE + S32K3XX_ADC_WTISR_OFFSET)
#define S32K3XX_ADC2_WTIMR                (S32K3XX_ADC2_BASE + S32K3XX_ADC_WTIMR_OFFSET)
#define S32K3XX_ADC2_DMAE                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_DMAE_OFFSET)
#define S32K3XX_ADC2_DMAR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_DMAR0_OFFSET)
#define S32K3XX_ADC2_DMAR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_DMAR1_OFFSET)
#define S32K3XX_ADC2_DMAR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_DMAR2_OFFSET)
#define S32K3XX_ADC2_THRHLR0              (S32K3XX_ADC2_BASE + S32K3XX_ADC_THRHLR0_OFFSET)
#define S32K3XX_ADC2_THRHLR1              (S32K3XX_ADC2_BASE + S32K3XX_ADC_THRHLR1_OFFSET)
#define S32K3XX_ADC2_THRHLR2              (S32K3XX_ADC2_BASE + S32K3XX_ADC_THRHLR2_OFFSET)
#define S32K3XX_ADC2_THRHLR3              (S32K3XX_ADC2_BASE + S32K3XX_ADC_THRHLR3_OFFSET)
#define S32K3XX_ADC2_PSCR                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_PSCR_OFFSET)
#define S32K3XX_ADC2_PSR0                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_PSR0_OFFSET)
#define S32K3XX_ADC2_PSR1                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_PSR1_OFFSET)
#define S32K3XX_ADC2_PSR2                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_PSR2_OFFSET)
#define S32K3XX_ADC2_CTR0                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_CTR0_OFFSET)
#define S32K3XX_ADC2_CTR1                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_CTR1_OFFSET)
#define S32K3XX_ADC2_CTR2                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_CTR2_OFFSET)
#define S32K3XX_ADC2_NCMR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_NCMR0_OFFSET)
#define S32K3XX_ADC2_NCMR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_NCMR1_OFFSET)
#define S32K3XX_ADC2_NCMR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_NCMR2_OFFSET)
#define S32K3XX_ADC2_JCMR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_JCMR0_OFFSET)
#define S32K3XX_ADC2_JCMR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_JCMR1_OFFSET)
#define S32K3XX_ADC2_JCMR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_JCMR2_OFFSET)
#define S32K3XX_ADC2_DSDR                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_DSDR_OFFSET)
#define S32K3XX_ADC2_PDEDR                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PDEDR_OFFSET)

#define S32K3XX_ADC2_PCDR(n)              (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR_OFFSET(n))
#define S32K3XX_ADC2_PCDR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR0_OFFSET)
#define S32K3XX_ADC2_PCDR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR1_OFFSET)
#define S32K3XX_ADC2_PCDR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR2_OFFSET)
#define S32K3XX_ADC2_PCDR3                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR3_OFFSET)
#define S32K3XX_ADC2_PCDR4                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR4_OFFSET)
#define S32K3XX_ADC2_PCDR5                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR5_OFFSET)
#define S32K3XX_ADC2_PCDR6                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR6_OFFSET)
#define S32K3XX_ADC2_PCDR7                (S32K3XX_ADC2_BASE + S32K3XX_ADC_PCDR7_OFFSET)

#define S32K3XX_ADC2_ICDR(n)              (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR_OFFSET(n))
#define S32K3XX_ADC2_ICDR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR0_OFFSET)
#define S32K3XX_ADC2_ICDR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR1_OFFSET)
#define S32K3XX_ADC2_ICDR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR2_OFFSET)
#define S32K3XX_ADC2_ICDR3                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR3_OFFSET)
#define S32K3XX_ADC2_ICDR4                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR4_OFFSET)
#define S32K3XX_ADC2_ICDR5                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR5_OFFSET)
#define S32K3XX_ADC2_ICDR6                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR6_OFFSET)
#define S32K3XX_ADC2_ICDR7                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR7_OFFSET)
#define S32K3XX_ADC2_ICDR8                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR8_OFFSET)
#define S32K3XX_ADC2_ICDR9                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR9_OFFSET)
#define S32K3XX_ADC2_ICDR10               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR10_OFFSET)
#define S32K3XX_ADC2_ICDR11               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR11_OFFSET)
#define S32K3XX_ADC2_ICDR12               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR12_OFFSET)
#define S32K3XX_ADC2_ICDR13               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR13_OFFSET)
#define S32K3XX_ADC2_ICDR14               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR14_OFFSET)
#define S32K3XX_ADC2_ICDR15               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR15_OFFSET)
#define S32K3XX_ADC2_ICDR16               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR16_OFFSET)
#define S32K3XX_ADC2_ICDR17               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR17_OFFSET)
#define S32K3XX_ADC2_ICDR18               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR18_OFFSET)
#define S32K3XX_ADC2_ICDR19               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR19_OFFSET)
#define S32K3XX_ADC2_ICDR20               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR20_OFFSET)
#define S32K3XX_ADC2_ICDR21               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR21_OFFSET)
#define S32K3XX_ADC2_ICDR22               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR22_OFFSET)
#define S32K3XX_ADC2_ICDR23               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ICDR23_OFFSET)

#define S32K3XX_ADC2_ECDR(n)              (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR_OFFSET(n))
#define S32K3XX_ADC2_ECDR0                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR0_OFFSET)
#define S32K3XX_ADC2_ECDR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR1_OFFSET)
#define S32K3XX_ADC2_ECDR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR2_OFFSET)
#define S32K3XX_ADC2_ECDR3                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR3_OFFSET)
#define S32K3XX_ADC2_ECDR4                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR4_OFFSET)
#define S32K3XX_ADC2_ECDR5                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR5_OFFSET)
#define S32K3XX_ADC2_ECDR6                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR6_OFFSET)
#define S32K3XX_ADC2_ECDR7                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR7_OFFSET)
#define S32K3XX_ADC2_ECDR8                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR8_OFFSET)
#define S32K3XX_ADC2_ECDR9                (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR9_OFFSET)
#define S32K3XX_ADC2_ECDR10               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR10_OFFSET)
#define S32K3XX_ADC2_ECDR11               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR11_OFFSET)
#define S32K3XX_ADC2_ECDR12               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR12_OFFSET)
#define S32K3XX_ADC2_ECDR13               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR13_OFFSET)
#define S32K3XX_ADC2_ECDR14               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR14_OFFSET)
#define S32K3XX_ADC2_ECDR15               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR15_OFFSET)
#define S32K3XX_ADC2_ECDR16               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR16_OFFSET)
#define S32K3XX_ADC2_ECDR17               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR17_OFFSET)
#define S32K3XX_ADC2_ECDR18               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR18_OFFSET)
#define S32K3XX_ADC2_ECDR19               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR19_OFFSET)
#define S32K3XX_ADC2_ECDR20               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR20_OFFSET)
#define S32K3XX_ADC2_ECDR21               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR21_OFFSET)
#define S32K3XX_ADC2_ECDR22               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR22_OFFSET)
#define S32K3XX_ADC2_ECDR23               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR23_OFFSET)
#define S32K3XX_ADC2_ECDR24               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR24_OFFSET)
#define S32K3XX_ADC2_ECDR25               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR25_OFFSET)
#define S32K3XX_ADC2_ECDR26               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR26_OFFSET)
#define S32K3XX_ADC2_ECDR27               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR27_OFFSET)
#define S32K3XX_ADC2_ECDR28               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR28_OFFSET)
#define S32K3XX_ADC2_ECDR29               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR29_OFFSET)
#define S32K3XX_ADC2_ECDR30               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR30_OFFSET)
#define S32K3XX_ADC2_ECDR31               (S32K3XX_ADC2_BASE + S32K3XX_ADC_ECDR31_OFFSET)

#define S32K3XX_ADC2_CWSELRPI0            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELRPI0_OFFSET)
#define S32K3XX_ADC2_CWSELRPI1            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELRPI1_OFFSET)
#define S32K3XX_ADC2_CWSELRSI0            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELRSI0_OFFSET)
#define S32K3XX_ADC2_CWSELRSI1            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELRSI1_OFFSET)
#define S32K3XX_ADC2_CWSELRSI2            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELRSI2_OFFSET)
#define S32K3XX_ADC2_CWSELREI0            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELREI0_OFFSET)
#define S32K3XX_ADC2_CWSELREI1            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELREI1_OFFSET)
#define S32K3XX_ADC2_CWSELREI2            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELREI2_OFFSET)
#define S32K3XX_ADC2_CWSELREI3            (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWSELREI3_OFFSET)
#define S32K3XX_ADC2_CWENR0               (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWENR0_OFFSET)
#define S32K3XX_ADC2_CWENR1               (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWENR1_OFFSET)
#define S32K3XX_ADC2_CWENR2               (S32K3XX_ADC2_BASE + S32K3XX_ADC_CWENR2_OFFSET)
#define S32K3XX_ADC2_AWORR0               (S32K3XX_ADC2_BASE + S32K3XX_ADC_AWORR0_OFFSET)
#define S32K3XX_ADC2_AWORR1               (S32K3XX_ADC2_BASE + S32K3XX_ADC_AWORR1_OFFSET)
#define S32K3XX_ADC2_AWORR2               (S32K3XX_ADC2_BASE + S32K3XX_ADC_AWORR2_OFFSET)
#define S32K3XX_ADC2_STCR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STCR1_OFFSET)
#define S32K3XX_ADC2_STCR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STCR2_OFFSET)
#define S32K3XX_ADC2_STCR3                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STCR3_OFFSET)
#define S32K3XX_ADC2_STBRR                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STBRR_OFFSET)
#define S32K3XX_ADC2_STSR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STSR1_OFFSET)
#define S32K3XX_ADC2_STSR2                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STSR2_OFFSET)
#define S32K3XX_ADC2_STSR3                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STSR3_OFFSET)
#define S32K3XX_ADC2_STSR4                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STSR4_OFFSET)
#define S32K3XX_ADC2_STDR1                (S32K3XX_ADC2_BASE + S32K3XX_ADC_STDR1_OFFSET)
#define S32K3XX_ADC2_STAW0R               (S32K3XX_ADC2_BASE + S32K3XX_ADC_STAW0R_OFFSET)
#define S32K3XX_ADC2_STAW1R               (S32K3XX_ADC2_BASE + S32K3XX_ADC_STAW1R_OFFSET)
#define S32K3XX_ADC2_STAW2R               (S32K3XX_ADC2_BASE + S32K3XX_ADC_STAW2R_OFFSET)
#define S32K3XX_ADC2_STAW4R               (S32K3XX_ADC2_BASE + S32K3XX_ADC_STAW4R_OFFSET)
#define S32K3XX_ADC2_STAW5R               (S32K3XX_ADC2_BASE + S32K3XX_ADC_STAW5R_OFFSET)
#define S32K3XX_ADC2_AMSIO                (S32K3XX_ADC2_BASE + S32K3XX_ADC_AMSIO_OFFSET )
#define S32K3XX_ADC2_CALBISTREG           (S32K3XX_ADC2_BASE + S32K3XX_ADC_CALBISTREG_OFFSET)
#define S32K3XX_ADC2_OFSGNUSR             (S32K3XX_ADC2_BASE + S32K3XX_ADC_OFSGNUSR_OFFSET)
#define S32K3XX_ADC2_CAL2                 (S32K3XX_ADC2_BASE + S32K3XX_ADC_CAL2_OFFSET)

/* ADC Register Bitfield Definitions ****************************************/

