apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
/* Main Configuration Register (MCR) */

#define ADC_MCR_PWDN                      (1 << 0)  /* Bit 0: Power Down (PWDN) */
#define ADC_MCR_ADCLKSEL_SHIFT            (1)       /* Bits 1-2: Conversion Clock (ADC_clk) Frequency Selection (ADCLKSEL) */
#define ADC_MCR_ADCLKSEL_MASK             (0x03 << ADC_MCR_ADCLKSEL_SHIFT)
#  define ADC_MCR_ADCLKSEL_DIV1           (0x00 << ADC_MCR_ADCLKSEL_SHIFT) /* (Module Clock Frequency)/1 */
#  define ADC_MCR_ADCLKSEL_DIV2           (0x01 << ADC_MCR_ADCLKSEL_SHIFT) /* (Module Clock Frequency)/2 */
#  define ADC_MCR_ADCLKSEL_DIV4           (0x02 << ADC_MCR_ADCLKSEL_SHIFT) /* (Module Clock Frequency)/4 */
#  define ADC_MCR_ADCLKSEL_DIV8           (0x03 << ADC_MCR_ADCLKSEL_SHIFT) /* (Module Clock Frequency)/8 */

                                                    /* Bits 3-4: Reserved */
#define ADC_MCR_ACKO                      (1 << 5)  /* Bit 5: Auto Clock Off (ACKO) */
#define ADC_MCR_ABORT                     (1 << 6)  /* Bit 6: Abort Conversion (ABORT) */
#define ADC_MCR_ABORTCHAIN                (1 << 7)  /* Bit 7: Abort Chain (ABORTCHAIN) */
                                                    /* Bit 8: Reserved */
#define ADC_MCR_AVGS_SHIFT                (9)       /* Bits 9-10: Averaging Select (AVGS) */
#define ADC_MCR_AVGS_MASK                 (0x03 << ADC_MCR_AVGS_SHIFT)
#  define ADC_MCR_AVGS_4CONV              (0x00 << ADC_MCR_AVGS_SHIFT) /*  4 Conversions */
#  define ADC_MCR_AVGS_8CONV              (0x01 << ADC_MCR_AVGS_SHIFT) /*  8 Conversions */
#  define ADC_MCR_AVGS_16CONV             (0x02 << ADC_MCR_AVGS_SHIFT) /* 16 Conversions */
#  define ADC_MCR_AVGS_32CONV             (0x03 << ADC_MCR_AVGS_SHIFT) /* 32 Conversions */

#define ADC_MCR_AVGEN                     (1 << 11) /* Bit 11: Averaging Enable (AVGEN) */
                                                    /* Bits 12-14: Reserved */
#define ADC_MCR_STCL                      (1 << 15) /* Bit 15: Self-Test Configuration Lock (STCL) */
#define ADC_MCR_BCTU_MODE                 (1 << 16) /* Bit 16: Body Cross Trigger Unit Mode Select (BCTU_MODE) */
#define ADC_MCR_BCTUEN                    (1 << 17) /* Bit 17: Body Cross Trigger Unit Enable (BCTUEN) */
                                                    /* Bit 18-19: Reserved */
#define ADC_MCR_JSTART                    (1 << 20) /* Bit 20: Injected Start (JSTART) */
#define ADC_MCR_JEDGE                     (1 << 21) /* Bit 21: Injected Trigger Edge Selection (JEDGE) */
#define ADC_MCR_JTRGEN                    (1 << 22) /* Bit 22: Injection Trigger Enable (JTRGEN) */
                                                    /* Bit 23: Reserved */
#define ADC_MCR_NSTART                    (1 << 24) /* Bit 24: Start Normal Conversion (NSTART) */
#define ADC_MCR_XSTRTEN                   (1 << 25) /* Bit 25: Auxiliary External Start Enable (XSTRTEN) */
#define ADC_MCR_EDGE                      (1 << 26) /* Bit 26: External Trigger Edge Selection (EDGE) */
#define ADC_MCR_TRGEN                     (1 << 27) /* Bit 27: External Trigger Enable (TRGEN) */
                                                    /* Bit 28: Reserved */
#define ADC_MCR_MODE                      (1 << 29) /* Bit 29: Normal Conversion Mode (MODE) */
#define ADC_MCR_WLSIDE                    (1 << 30) /* Bit 30: Write Left-Aligned (WLSIDE) */
#define ADC_MCR_OWREN                     (1 << 31) /* Bit 31: Overwrite Enable (OWREN) */

/* Main Status Register (MSR) */

#define ADC_MSR_ADCSTATUS_SHIFT           (0)       /* Bits 0-2: ADC State (ADCSTATUS) */
#define ADC_MSR_ADCSTATUS_MASK            (0x07 << ADC_MSR_ADCSTATUS_SHIFT)
#  define ADC_MSR_ADCSTATUS_IDLE          (0x00 << ADC_MSR_ADCSTATUS_SHIFT) /* Idle */
#  define ADC_MSR_ADCSTATUS_PWRDOWN       (0x01 << ADC_MSR_ADCSTATUS_SHIFT) /* Power Down */
#  define ADC_MSR_ADCSTATUS_WAIT          (0x02 << ADC_MSR_ADCSTATUS_SHIFT) /* Wait */
#  define ADC_MSR_ADCSTATUS_CALIB         (0x03 << ADC_MSR_ADCSTATUS_SHIFT) /* Calibrate */
#  define ADC_MSR_ADCSTATUS_CONV          (0x04 << ADC_MSR_ADCSTATUS_SHIFT) /* Convert */
#  define ADC_MSR_ADCSTATUS_DONE          (0x06 << ADC_MSR_ADCSTATUS_SHIFT) /* Done */

                                                    /* Bits 3-4: Reserved */
#define ADC_MSR_ADCO                      (1 << 5)  /* Bit 5: Auto Clock-Off On (ACKO) */
                                                    /* Bits 6-8: Reserved */
#define ADC_MSR_CHADDR_SHIFT              (9)       /* Bits 9-15: Input Under Measure (CHADDR) */
#define ADC_MSR_CHADDR_MASK               (0x7f << ADC_MSR_CHADDR_SHIFT)
#define ADC_MSR_BCTUSTART                 (1 << 16) /* Bit 16: BCTU Conversion Started (BCTUSTART) */
                                                    /* Bit 17: Reserved */
#define ADC_MSR_SELF_TEST_S               (1 << 18) /* Bit 18: Indicates whether an ongoing conversion is for self-test (SELF_TEST_S) */
                                                    /* Bit 19: Reserved */
#define ADC_MSR_JSTART                    (1 << 20) /* Bit 20: Injected Conversion Started (JSTART) */
                                                    /* Bits 21-22: Reserved */
#define ADC_MSR_JABORT                    (1 << 23) /* Bit 23: Injected Conversion Aborted (JABORT) */
#define ADC_MSR_NSTART                    (1 << 24) /* Bit 24: Normal Conversion Started (NSTART) */
                                                    /* Bits 25-30: Reserved */
#define ADC_MSR_CALIBRTD                  (1 << 31) /* Bit 31: Calibration Status (CALIBRTD) */

/* Interrupt Status Register (ISR) */

#define ADC_ISR_ECH                       (1 << 0)  /* Bit 0: End of Chain Conversion (ECH) */
#define ADC_ISR_EOC                       (1 << 1)  /* Bit 1: End of Conversion (EOC) */
#define ADC_ISR_JECH                      (1 << 2)  /* Bit 2: End of Injected Chain Conversion (JECH) */
#define ADC_ISR_JEOC                      (1 << 3)  /* Bit 3: End of Injected Conversion (JEOC) */
#define ADC_ISR_EOBCTU                    (1 << 4)  /* Bit 4: End of BCTU Conversion (EOBCTU) */
                                                    /* Bits 5-31: Reserved */

/* Channel End Of Conversation Flag Register for Precision Inputs (CEOCFR0) */

#define ADC_CEOCFR0_PIEOCF(n)             (1 << (n)) /* Bits 0-7: Precision Input End of Conversion Flag n (PIEOCFn) */
                                                     /* Bits 8-31: Reserved */

/* Channel End Of Conversation Flag Register for Standard Inputs (CEOCFR1) */

#define ADC_CEOCFR1_SIEOCF(n)             (1 << (n)) /* Bits 0-23: Standard Input End of Conversion Flag n (SIEOCFn) */
                                                     /* Bits 24-31: Reserved */

/* Channel End Of Conversation Flag Register for External Inputs (CEOCFR2) */

#define ADC_CEOCFR2_EIEOCF(n)             (1 << (n)) /* Bits 0-31: External Input End of Conversion Flag n (EIEOCFn) */

/* Interrupt Mask Register (IMR) */

