apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define ADC_IMR_MSKECH                    (1 << 0)  /* Bit 0: ECH Interrupt Flag Enable (MSKECH) */
#define ADC_IMR_MSKEOC                    (1 << 1)  /* Bit 1: EOC Interrupt Flag Enable (MSKEOC) */
#define ADC_IMR_MSKJECH                   (1 << 2)  /* Bit 2: JECH Interrupt Flag Enable (MSKJECH) */
#define ADC_IMR_MSKJEOC                   (1 << 3)  /* Bit 3: JEOC Interrupt Flag Enable (MSKJEOC) */
#define ADC_IMR_MSKEOBCTU                 (1 << 4)  /* Bit 4: EOBCTU Interrupt Flag Enable (MSKEOBCTU) */
                                                    /* Bits 5-31: Reserved */

/* EOC Interrupt Enable Register for Precision Inputs (CIMR0) */

#define ADC_CIMR0_PIEOCIEN(n)             (1 << (n)) /* Bits 0-7: Precision Input EOC Interrupt Enable n (PIEOCIEN) */
                                                     /* Bits 8-31: Reserved */

/* EOC Interrupt Enable Register for Standard Inputs (CIMR1) */

#define ADC_CIMR1_SIEOCIEN(n)             (1 << (n)) /* Bits 0-23: Standard Input EOC Interrupt Enable n (SIEOCIEN) */
                                                     /* Bits 24-31: Reserved */

/* EOC Interrupt Enable Register for External Inputs (CIMR2) */

#define ADC_CIMR2_EIEOCIEN(n)             (1 << (n)) /* Bits 0-31: External Input EOC Interrupt Enable n (EIEOCIEN) */

/* Analog Watchdog Threshold Interrupt Status Register (WTISR) */

#define ADC_WTISR_LAWIF1                  (1 << 0)  /* Bit 0: Low Analog Watchdog Interrupt Flag Enable 1 (LAWIF1) */
#define ADC_WTISR_HAWIF1                  (1 << 1)  /* Bit 1: High Analog Watchdog Interrupt Flag Enable 1 (HAWIF1) */
#define ADC_WTISR_LAWIF2                  (1 << 2)  /* Bit 2: Low Analog Watchdog Interrupt Flag Enable 2 (LAWIF2) */
#define ADC_WTISR_HAWIF2                  (1 << 3)  /* Bit 3: High Analog Watchdog Interrupt Flag Enable 2 (HAWIF2) */
#define ADC_WTISR_LAWIF3                  (1 << 4)  /* Bit 4: Low Analog Watchdog Interrupt Flag Enable 3 (LAWIF3) */
#define ADC_WTISR_HAWIF3                  (1 << 5)  /* Bit 5: High Analog Watchdog Interrupt Flag Enable 3 (HAWIF3) */
#define ADC_WTISR_LAWIF4                  (1 << 6)  /* Bit 6: Low Analog Watchdog Interrupt Flag Enable 4 (LAWIF4) */
#define ADC_WTISR_HAWIF4                  (1 << 7)  /* Bit 7: High Analog Watchdog Interrupt Flag Enable 4 (HAWIF4) */
#define ADC_WTISR_LAWIF5                  (1 << 8)  /* Bit 8: Low Analog Watchdog Interrupt Flag Enable 5 (LAWIF5) */
#define ADC_WTISR_HAWIF5                  (1 << 9)  /* Bit 9: High Analog Watchdog Interrupt Flag Enable 5 (HAWIF5) */
#define ADC_WTISR_LAWIF6                  (1 << 10) /* Bit 10: Low Analog Watchdog Interrupt Flag Enable 6 (LAWIF6) */
#define ADC_WTISR_HAWIF6                  (1 << 11) /* Bit 11: High Analog Watchdog Interrupt Flag Enable 6 (HAWIF6) */
#define ADC_WTISR_LAWIF7                  (1 << 12) /* Bit 12: Low Analog Watchdog Interrupt Flag Enable 7 (LAWIF7) */
#define ADC_WTISR_HAWIF7                  (1 << 13) /* Bit 13: High Analog Watchdog Interrupt Flag Enable 7 (HAWIF7) */
#define ADC_WTISR_LAWIF8                  (1 << 14) /* Bit 14: Low Analog Watchdog Interrupt Flag Enable 8 (LAWIF8) */
#define ADC_WTISR_HAWIF8                  (1 << 15) /* Bit 15: High Analog Watchdog Interrupt Flag Enable 8 (HAWIF8) */
#define ADC_WTISR_LAWIF9                  (1 << 16) /* Bit 16: Low Analog Watchdog Interrupt Flag Enable 9 (LAWIF9) */
#define ADC_WTISR_HAWIF9                  (1 << 17) /* Bit 17: High Analog Watchdog Interrupt Flag Enable 9 (HAWIF9) */
#define ADC_WTISR_LAWIF10                 (1 << 18) /* Bit 18: Low Analog Watchdog Interrupt Flag Enable 10 (LAWIF10) */
#define ADC_WTISR_HAWIF10                 (1 << 19) /* Bit 19: High Analog Watchdog Interrupt Flag Enable 10 (HAWIF10) */
#define ADC_WTISR_LAWIF11                 (1 << 20) /* Bit 20: Low Analog Watchdog Interrupt Flag Enable 11 (LAWIF11) */
#define ADC_WTISR_HAWIF11                 (1 << 21) /* Bit 21: High Analog Watchdog Interrupt Flag Enable 11 (HAWIF11) */
#define ADC_WTISR_LAWIF12                 (1 << 22) /* Bit 22: Low Analog Watchdog Interrupt Flag Enable 12 (LAWIF12) */
#define ADC_WTISR_HAWIF12                 (1 << 23) /* Bit 23: High Analog Watchdog Interrupt Flag Enable 12 (HAWIF12) */
#define ADC_WTISR_LAWIF13                 (1 << 24) /* Bit 24: Low Analog Watchdog Interrupt Flag Enable 13 (LAWIF13) */
#define ADC_WTISR_HAWIF13                 (1 << 25) /* Bit 25: High Analog Watchdog Interrupt Flag Enable 13 (HAWIF13) */
#define ADC_WTISR_LAWIF14                 (1 << 26) /* Bit 26: Low Analog Watchdog Interrupt Flag Enable 14 (LAWIF14) */
#define ADC_WTISR_HAWIF14                 (1 << 27) /* Bit 27: High Analog Watchdog Interrupt Flag Enable 14 (HAWIF14) */
#define ADC_WTISR_LAWIF15                 (1 << 28) /* Bit 28: Low Analog Watchdog Interrupt Flag Enable 15 (LAWIF15) */
#define ADC_WTISR_HAWIF15                 (1 << 29) /* Bit 29: High Analog Watchdog Interrupt Flag Enable 15 (HAWIF15) */
#define ADC_WTISR_LAWIF16                 (1 << 30) /* Bit 30: Low Analog Watchdog Interrupt Flag Enable 16 (LAWIF16) */
#define ADC_WTISR_HAWIF16                 (1 << 31) /* Bit 31: High Analog Watchdog Interrupt Flag Enable 16 (HAWIF16) */

/* Analog Watchdog Threshold Interrupt Enable Register (WTIMR) */

#define ADC_WTIMR_LAWIFEN1                (1 << 0)  /* Bit 0: Low Analog Watchdog Interrupt Flag Enable 1 (LAWIFEN1) */
#define ADC_WTIMR_HDWIFEN1                (1 << 1)  /* Bit 1: High Data Watchdog Interrupt Flag Enable 1 (HDWIFEN1) */
#define ADC_WTIMR_LAWIFEN2                (1 << 2)  /* Bit 2: Low Analog Watchdog Interrupt Flag Enable 2 (LAWIFEN2) */
#define ADC_WTIMR_HDWIFEN2                (1 << 3)  /* Bit 3: High Data Watchdog Interrupt Flag Enable 2 (HDWIFEN2) */
#define ADC_WTIMR_LAWIFEN3                (1 << 4)  /* Bit 4: Low Analog Watchdog Interrupt Flag Enable 3 (LAWIFEN3) */
#define ADC_WTIMR_HDWIFEN3                (1 << 5)  /* Bit 5: High Data Watchdog Interrupt Flag Enable 3 (HDWIFEN3) */
#define ADC_WTIMR_LAWIFEN4                (1 << 6)  /* Bit 6: Low Analog Watchdog Interrupt Flag Enable 4 (LAWIFEN4) */
#define ADC_WTIMR_HDWIFEN4                (1 << 7)  /* Bit 7: High Data Watchdog Interrupt Flag Enable 4 (HDWIFEN4) */
                                                    /* Bits 8-31: Reserved */

/* Direct Memory Access Configuration Register (DMAE) */

#define ADC_DMAE_DMAEN                    (1 << 0)  /* Bit 0: DMA Enable (DMAEN) */
#define ADC_DMAE_DCLR                     (1 << 1)  /* Bit 1: DMA Clear Request (DCLR) */
                                                    /* Bits 2-31: Reserved */

/* DMA Request Enable Register for Precision Inputs (DMAR0) */

