apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define ADC_DMAR0_PIDMAREN(n)             (1 << (n)) /* Bits 0-7: Precision Input DMA Request Enable n (PIDMARENn) */
                                                     /* Bits 8-31: Reserved */

/* DMA Request Enable Register for Standard Inputs (DMAR1) */

#define ADC_DMAR1_SIDMAREN(n)             (1 << (n)) /* Bits 0-23: Standard Input DMA Request Enable n (SIDMARENn) */
                                                     /* Bits 24-31: Reserved */

/* DMA Request Enable Register for External Inputs (DMAR2) */

#define ADC_DMAR2_EIDMAREN(n)             (1 << (n)) /* Bits 0-31: External Input DMA Request Enable n (EIDMARENn) */

/* Analog Watchdog Threshold Values Register n (THRHLRn) */

#define ADC_THRHLR_THRL_SHIFT             (0)       /* Bits 0-14: Low Threshold Value (THRL) */
#define ADC_THRHLR_THRL_MASK              (0x7fff << ADC_THRHLR_THRL_SHIFT)
                                                    /* Bit 15: Reserved */
#define ADC_THRHLR_THRH_SHIFT             (16)      /* Bits 16-30: High Threshold Value (THRH) */
#define ADC_THRHLR_THRH_MASK              (0x7fff << ADC_THRHLR_THRH_SHIFT)
                                                    /* Bit 31: Reserved */

/* Presampling Control Register (PSCR) */

#define ADC_PSCR_PRECONV                  (1 << 0)  /* Bit 0: Convert Presampled Value (PRECONV) */
#define ADC_PSCR_PREVAL0                  (1 << 1)  /* Bit 1: Presampling Voltage Select for Precision Inputs (PREVAL0) */
                                                    /* Bit 2: Reserved */
#define ADC_PSCR_PREVAL1                  (1 << 3)  /* Bit 3: Presampling Voltage Select for Standard Inputs (PREVAL1) */
                                                    /* Bit 4: Reserved */
#define ADC_PSCR_PREVAL2                  (1 << 5)  /* Bit 5: Presampling Voltage Select for External Inputs (PREVAL2) */
                                                    /* Bits 6-31: Reserved */

/* Presampling Enable Register for Precision Inputs (PSR0) */

#define ADC_PSR0_PRES(n)                  (1 << (n)) /* Bits 0-7: Presampling Enable n (PRESn) */
                                                     /* Bits 8-31: Reserved */

/* Presampling Enable Register for Standard Inputs (PSR1) */

#define ADC_PSR1_PRES(n)                  (1 << (n)) /* Bits 0-23: Presampling Enable n (PRESn) */
                                                     /* Bits 24-31: Reserved */

/* Presampling Enable Register for External Inputs (PSR2) */

#define ADC_PSR2_PRES(n)                  (1 << (n)) /* Bits 0-31: Presampling Enable n (PRESn) */

/* Conversion Timing Register for Precision Inputs (CTR0) */

#define ADC_CTR0_INPSAMP_SHIFT            (0)        /* Bits 0-7: Input Sample Cycles (INPSAMP) */
#define ADC_CTR0_INPSAMP_MASK             (0xff << ADC_CTR0_INPSAMP_SHIFT)
                                                     /* Bits 8-31: Reserved */

/* Conversion Timing Register for Standard Inputs (CTR1) */

#define ADC_CTR1_INPSAMP_SHIFT            (0)        /* Bits 0-7: Input Sample Cycles (INPSAMP) */
#define ADC_CTR1_INPSAMP_MASK             (0xff << ADC_CTR1_INPSAMP_SHIFT)
                                                     /* Bits 8-31: Reserved */

/* Conversion Timing Register for External Inputs (CTR2) */

#define ADC_CTR2_INPSAMP_SHIFT            (0)        /* Bits 0-7: Input Sample Cycles (INPSAMP) */
#define ADC_CTR2_INPSAMP_MASK             (0xff << ADC_CTR2_INPSAMP_SHIFT)
                                                     /* Bits 8-31: Reserved */

/* Normal Conversion Enable Register for Precision Inputs (NCMR0) */

#define ADC_NMCR0_CH(n)                   (1 << (n)) /* Bits 0-7: Precision Input n to be Converted (CHn) */
                                                     /* Bits 8-31: Reserved */

/* Normal Conversion Enable Register for Standard Inputs (NCMR1) */

#define ADC_NMCR1_CH(n)                   (1 << (n)) /* Bits 0-23: Standard Input n to be Converted (CHn) */
                                                     /* Bits 24-31: Reserved */

/* Normal Conversion Enable Register for External Inputs (NCMR2) */

#define ADC_NMCR2_CH(n)                   (1 << (n)) /* Bits 0-31: External Input n to be Converted (CHn) */

/* Injected Conversion Enable Register for Precision Inputs (JCMR0) */

#define ADC_JMCR0_CH(n)                   (1 << (n)) /* Bits 0-7: Precision Input to be Converted (CHn) */
                                                     /* Bits 8-31: Reserved */

/* Injected Conversion Enable Register for Standard Inputs (JCMR1) */

#define ADC_JMCR1_CH(n)                   (1 << (n)) /* Bits 0-23: Standard Input to be Converted (CHn) */
                                                     /* Bits 24-31: Reserved */

/* Injected Conversion Enable Register for External Inputs (JCMR2) */

#define ADC_JMCR2_CH(n)                   (1 << (n)) /* Bits 0-31: External Input to be Converted (CHn) */

/* Delay Start of Data Conversion Register (DSDR) */

#define ADC_DSDR_DSD_SHIFT                (0)       /* Bits 0-15: Delay (DSD) */
#define ASD_DSDR_DSD_MASK                 (0xff << ADC_DSDR_DSD_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* Power Down Exit Delay Register (PDEDR) */

#define ADC_PDEDR_PDED_SHIFT              (0)       /* Bits 0-7: Delay (PDED) */
#define ASD_PDEDR_PDED_MASK               (0x0f << ADC_PDEDR_PDED_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Precision Input n Conversion Data Register (PCDRn) */

#define ADC_PCDR_CDATA_SHIFT              (0)       /* Bits 0-15: Conversion Data (CDATA) */
#define ADC_PCDR_CDATA_MASK               (0xff << ADC_PCDR_CDATA_SHIFT)
#define ADC_PCDR_RESULT_SHIFT             (16)      /* Bits 16-17: Conversion Data Type (RESULT) */
#define ADC_PCDR_RESULT_MASK              (0x03 << ADC_PCDR_RESULT_SHIFT)
#  define ADC_PCDR_RESULT_NORM            (0x00 << ADC_PCDR_RESULT_MASK) /* Normal Trigger */
#  define ADC_PCDR_RESULT_INJ             (0x01 << ADC_PCDR_RESULT_MASK) /* Injected Trigger */
#  define ADC_PCDR_RESULT_BCTU            (0x02 << ADC_PCDR_RESULT_MASK) /* BCTU Trigger */

#define ADC_PCDR_OVERW                    (1 << 18) /* Bit 18: Overwrite Status Flag (OVERW) */
#define ADC_PCDR_VALID                    (1 << 19) /* Bit 19: Conversion Data Available (VALID) */
                                                    /* Bits 20-31: Reserved */

/* Standard Input n Conversion Data Register (ICDRn) */

#define ADC_ICDR_CDATA_SHIFT              (0)       /* Bits 0-15: Conversion Data (CDATA) */
#define ADC_ICDR_CDATA_MASK               (0xff << ADC_ICDR_CDATA_SHIFT)
#define ADC_ICDR_RESULT_SHIFT             (16)      /* Bits 16-17: Conversion Data Type (RESULT) */
#define ADC_ICDR_RESULT_MASK              (0x03 << ADC_ICDR_RESULT_SHIFT)
#  define ADC_ICDR_RESULT_NORM            (0x00 << ADC_ICDR_RESULT_MASK) /* Normal Trigger */
#  define ADC_ICDR_RESULT_INJ             (0x01 << ADC_ICDR_RESULT_MASK) /* Injected Trigger */
#  define ADC_ICDR_RESULT_BCTU            (0x02 << ADC_ICDR_RESULT_MASK) /* BCTU Trigger */

