apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define ADC_ICDR_OVERW                    (1 << 18) /* Bit 18: Overwrite Status Flag (OVERW) */
#define ADC_ICDR_VALID                    (1 << 19) /* Bit 19: Conversion Data Available (VALID) */
                                                    /* Bits 20-31: Reserved */

/* External Input n Conversion Data Register (ECDRn) */

#define ADC_ECDR_CDATA_SHIFT              (0)       /* Bits 0-15: Conversion Data (CDATA) */
#define ADC_ECDR_CDATA_MASK               (0xff << ADC_ECDR_CDATA_SHIFT)
#define ADC_ECDR_RESULT_SHIFT             (16)      /* Bits 16-17: Conversion Data Type (RESULT) */
#define ADC_ECDR_RESULT_MASK              (0x03 << ADC_ECDR_RESULT_SHIFT)
#  define ADC_ECDR_RESULT_NORM            (0x00 << ADC_ECDR_RESULT_SHIFT) /* Normal Trigger */
#  define ADC_ECDR_RESULT_INJ             (0x01 << ADC_ECDR_RESULT_SHIFT) /* Injected Trigger */
#  define ADC_ECDR_RESULT_BCTU            (0x02 << ADC_ECDR_RESULT_SHIFT) /* BCTU Trigger */

#define ADC_ECDR_OVERW                    (1 << 18) /* Bit 18: Overwrite Status Flag (OVERW) */
#define ADC_ECDR_VALID                    (1 << 19) /* Bit 19: Conversion Data Available (VALID) */
                                                    /* Bits 20-31: Reserved */

/* Channel Analog Watchdog Select Register for Precision Inputs 0
 * (CWSELRPI0)
 */

#define ADC_CWSELRPI0_WSEL_SI0_0_SHIFT    (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI0_0) */
#define ADC_CWSELRPI0_WSEL_SI0_0_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_0_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_1_SHIFT    (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI0_1) */
#define ADC_CWSELRPI0_WSEL_SI0_1_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_1_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_2_SHIFT    (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI0_2) */
#define ADC_CWSELRPI0_WSEL_SI0_2_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_2_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_3_SHIFT    (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI0_3) */
#define ADC_CWSELRPI0_WSEL_SI0_3_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_3_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_4_SHIFT    (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI0_4) */
#define ADC_CWSELRPI0_WSEL_SI0_4_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_4_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_5_SHIFT    (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI0_5) */
#define ADC_CWSELRPI0_WSEL_SI0_5_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_5_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_6_SHIFT    (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI0_6) */
#define ADC_CWSELRPI0_WSEL_SI0_6_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_6_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELRPI0_WSEL_SI0_7_SHIFT    (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI0_7) */
#define ADC_CWSELRPI0_WSEL_SI0_7_MASK     (0x03 << ADC_CWSELRPI0_WSEL_SI0_7_SHIFT)
                                                    /* Bits 30-31: Reserved */

/* Channel Analog Watchdog Select Register for Precision Inputs 1
 * (CWSELRPI1)
 */

                                                    /* Bits 0-31: Reserved */

/* Channel Analog Watchdog Select Register for Standard Inputs 0
 * (CWSELRSI0)
 */

#define ADC_CWSELRSI0_WSEL_SI0_0_SHIFT    (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI0_0) */
#define ADC_CWSELRSI0_WSEL_SI0_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI0_0_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELRSI0_WSEL_SI1_0_SHIFT    (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI1_0) */
#define ADC_CWSELRSI0_WSEL_SI1_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI1_0_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELRSI0_WSEL_SI2_0_SHIFT    (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI2_0) */
#define ADC_CWSELRSI0_WSEL_SI2_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI2_0_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELRSI0_WSEL_SI3_0_SHIFT    (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI3_0) */
#define ADC_CWSELRSI0_WSEL_SI3_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI3_0_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELRSI0_WSEL_SI4_0_SHIFT    (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI4_0) */
#define ADC_CWSELRSI0_WSEL_SI4_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI4_0_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELRSI0_WSEL_SI5_0_SHIFT    (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI5_0) */
#define ADC_CWSELRSI0_WSEL_SI5_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI5_0_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELRSI0_WSEL_SI6_0_SHIFT    (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI6_0) */
#define ADC_CWSELRSI0_WSEL_SI6_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI6_0_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELRSI0_WSEL_SI7_0_SHIFT    (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI7_0) */
#define ADC_CWSELRSI0_WSEL_SI7_0_MASK     (0x03 << ADC_CWSELRSI0_WSEL_SI7_0_SHIFT)
                                                    /* Bits 30-31: Reserved */

/* Channel Analog Watchdog Select Register for Standard Inputs 1
 * (CWSELRSI1)
 */

#define ADC_CWSELRSI1_WSEL_SI0_1_SHIFT    (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI0_1) */
#define ADC_CWSELRSI1_WSEL_SI0_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI0_1_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELRSI1_WSEL_SI1_1_SHIFT    (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI1_1) */
#define ADC_CWSELRSI1_WSEL_SI1_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI1_1_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELRSI1_WSEL_SI2_1_SHIFT    (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI2_1) */
#define ADC_CWSELRSI1_WSEL_SI2_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI2_1_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELRSI1_WSEL_SI3_1_SHIFT    (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI3_1) */
#define ADC_CWSELRSI1_WSEL_SI3_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI3_1_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELRSI1_WSEL_SI4_1_SHIFT    (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI4_1) */
#define ADC_CWSELRSI1_WSEL_SI4_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI4_1_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELRSI1_WSEL_SI5_1_SHIFT    (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI5_1) */
#define ADC_CWSELRSI1_WSEL_SI5_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI5_1_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELRSI1_WSEL_SI6_1_SHIFT    (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI6_1) */
#define ADC_CWSELRSI1_WSEL_SI6_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI6_1_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELRSI1_WSEL_SI7_1_SHIFT    (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI7_1) */
#define ADC_CWSELRSI1_WSEL_SI7_1_MASK     (0x03 << ADC_CWSELRSI1_WSEL_SI7_1_SHIFT)

/* Channel Analog Watchdog Select Register for Standard Inputs 2
 * (CWSELRSI2)
 */

#define ADC_CWSELRSI2_WSEL_SI0_2_SHIFT    (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI0_2) */
#define ADC_CWSELRSI2_WSEL_SI0_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI0_2_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELRSI2_WSEL_SI1_2_SHIFT    (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI1_2) */
#define ADC_CWSELRSI2_WSEL_SI1_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI1_2_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELRSI2_WSEL_SI2_2_SHIFT    (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI2_2) */
#define ADC_CWSELRSI2_WSEL_SI2_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI2_2_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELRSI2_WSEL_SI3_2_SHIFT    (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI3_2) */
#define ADC_CWSELRSI2_WSEL_SI3_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI3_2_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELRSI2_WSEL_SI4_2_SHIFT    (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI4_2) */
#define ADC_CWSELRSI2_WSEL_SI4_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI4_2_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELRSI2_WSEL_SI5_2_SHIFT    (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI5_2) */
#define ADC_CWSELRSI2_WSEL_SI5_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI5_2_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELRSI2_WSEL_SI6_2_SHIFT    (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI6_2) */
#define ADC_CWSELRSI2_WSEL_SI6_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI6_2_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELRSI2_WSEL_SI7_2_SHIFT    (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI7_2) */
#define ADC_CWSELRSI2_WSEL_SI7_2_MASK     (0x03 << ADC_CWSELRSI2_WSEL_SI7_2_SHIFT)

/* Channel Analog Watchdog Select Register for External Inputs 0
 * (CWSELREI0)
 */

#define ADC_CWSELREI0_WSEL_SI0_0_SHIFT    (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI0_0) */
#define ADC_CWSELREI0_WSEL_SI0_0_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_0_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_1_SHIFT    (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI0_1) */
#define ADC_CWSELREI0_WSEL_SI0_1_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_1_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_2_SHIFT    (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI0_2) */
#define ADC_CWSELREI0_WSEL_SI0_2_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_2_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_3_SHIFT    (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI0_3) */
#define ADC_CWSELREI0_WSEL_SI0_3_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_3_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_4_SHIFT    (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI0_4) */
#define ADC_CWSELREI0_WSEL_SI0_4_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_4_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_5_SHIFT    (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI0_5) */
#define ADC_CWSELREI0_WSEL_SI0_5_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_5_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_6_SHIFT    (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI0_6) */
#define ADC_CWSELREI0_WSEL_SI0_6_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_6_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELREI0_WSEL_SI0_7_SHIFT    (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI0_7) */
#define ADC_CWSELREI0_WSEL_SI0_7_MASK     (0x03 << ADC_CWSELREI0_WSEL_SI0_7_SHIFT)
                                                    /* Bits 30-31: Reserved */

