apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
/* Channel Analog Watchdog Select Register for External Inputs 1
 * (CWSELREI1)
 */

#define ADC_CWSELREI1_WSEL_SI1_8_SHIFT    (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI1_8) */
#define ADC_CWSELREI1_WSEL_SI1_8_MASK     (0x03 << ADC_CWSELREI1_WSEL_SI1_8_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_9_SHIFT    (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI1_9) */
#define ADC_CWSELREI1_WSEL_SI1_9_MASK     (0x03 << ADC_CWSELREI1_WSEL_SI1_9_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_10_SHIFT   (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI1_10) */
#define ADC_CWSELREI1_WSEL_SI1_10_MASK    (0x03 << ADC_CWSELREI1_WSEL_SI1_10_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_11_SHIFT   (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI1_11) */
#define ADC_CWSELREI1_WSEL_SI1_11_MASK    (0x03 << ADC_CWSELREI1_WSEL_SI1_11_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_12_SHIFT   (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI1_12) */
#define ADC_CWSELREI1_WSEL_SI1_12_MASK    (0x03 << ADC_CWSELREI1_WSEL_SI1_12_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_13_SHIFT   (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI1_13) */
#define ADC_CWSELREI1_WSEL_SI1_13_MASK    (0x03 << ADC_CWSELREI1_WSEL_SI1_13_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_14_SHIFT   (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI1_14) */
#define ADC_CWSELREI1_WSEL_SI1_14_MASK    (0x03 << ADC_CWSELREI1_WSEL_SI1_14_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELREI1_WSEL_SI1_15_SHIFT   (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI1_15) */
#define ADC_CWSELREI1_WSEL_SI1_15_MASK    (0x03 << ADC_CWSELREI1_WSEL_SI1_15_SHIFT)
                                                    /* Bits 30-31: Reserved */

/* Channel Analog Watchdog Select Register for External Inputs 2
 * (CWSELREI2)
 */

#define ADC_CWSELREI2_WSEL_SI2_16_SHIFT   (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI2_16) */
#define ADC_CWSELREI2_WSEL_SI2_16_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_16_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_17_SHIFT   (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI2_17) */
#define ADC_CWSELREI2_WSEL_SI2_17_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_17_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_18_SHIFT   (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI2_18) */
#define ADC_CWSELREI2_WSEL_SI2_18_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_18_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_19_SHIFT   (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI2_19) */
#define ADC_CWSELREI2_WSEL_SI2_19_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_19_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_20_SHIFT   (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI2_20) */
#define ADC_CWSELREI2_WSEL_SI2_20_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_20_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_21_SHIFT   (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI2_21) */
#define ADC_CWSELREI2_WSEL_SI2_21_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_21_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_22_SHIFT   (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI2_22) */
#define ADC_CWSELREI2_WSEL_SI2_22_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_22_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELREI2_WSEL_SI2_23_SHIFT   (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI2_23) */
#define ADC_CWSELREI2_WSEL_SI2_23_MASK    (0x03 << ADC_CWSELREI2_WSEL_SI2_23_SHIFT)
                                                    /* Bits 30-31: Reserved */

/* Channel Analog Watchdog Select Register for External Inputs 3
 * (CWSELREI3)
 */

#define ADC_CWSELREI3_WSEL_SI3_24_SHIFT   (0)       /* Bits 0-1: Analog Watchdog Selection (WSEL_SI3_24) */
#define ADC_CWSELREI3_WSEL_SI3_24_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_24_SHIFT)
                                                    /* Bits 2-3: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_25_SHIFT   (4)       /* Bits 4-5: Analog Watchdog Selection (WSEL_SI3_25) */
#define ADC_CWSELREI3_WSEL_SI3_25_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_25_SHIFT)
                                                    /* Bits 6-7: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_26_SHIFT   (8)       /* Bits 8-9: Analog Watchdog Selection (WSEL_SI3_26) */
#define ADC_CWSELREI3_WSEL_SI3_26_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_26_SHIFT)
                                                    /* Bits 10-11: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_27_SHIFT   (12)      /* Bits 12-13: Analog Watchdog Selection (WSEL_SI3_27) */
#define ADC_CWSELREI3_WSEL_SI3_27_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_27_SHIFT)
                                                    /* Bits 14-15: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_28_SHIFT   (16)      /* Bits 16-17: Analog Watchdog Selection (WSEL_SI3_28) */
#define ADC_CWSELREI3_WSEL_SI3_28_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_28_SHIFT)
                                                    /* Bits 18-19: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_29_SHIFT   (20)      /* Bits 20-21: Analog Watchdog Selection (WSEL_SI3_29) */
#define ADC_CWSELREI3_WSEL_SI3_29_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_29_SHIFT)
                                                    /* Bits 22-23: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_30_SHIFT   (24)      /* Bits 24-25: Analog Watchdog Selection (WSEL_SI3_30) */
#define ADC_CWSELREI3_WSEL_SI3_30_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_30_SHIFT)
                                                    /* Bits 26-27: Reserved */
#define ADC_CWSELREI3_WSEL_SI3_31_SHIFT   (28)      /* Bits 28-29: Analog Watchdog Selection (WSEL_SI3_31) */
#define ADC_CWSELREI3_WSEL_SI3_31_MASK    (0x03 << ADC_CWSELREI3_WSEL_SI3_31_SHIFT)
                                                    /* Bits 30-31: Reserved */

/* Channel Watchdog Enable Register for Precision Inputs (CWENR0) */

#define ADC_CWENR0_CWEN(n)                (1 << (n)) /* Bits 0-7: Channel Analog Watchdog Enable for Precision Inputs (CWENn) */
                                                     /* Bits 8-31: Reserved */

/* Channel Watchdog Enable Register for Standard Inputs (CWENR1) */

#define ADC_CWENR1_CWEN(n)                (1 << (n)) /* Bits 0-23: Channel Analog Watchdog Enable for Standard Inputs (CWENn) */
                                                     /* Bits 24-31: Reserved */

/* Channel Watchdog Enable Register for External Inputs (CWENR2) */

#define ADC_CWENR2_CWEN(n)                (1 << (n)) /* Bits 0-31: Channel Analog Watchdog Enable for External Inputs (CWENn) */

/* Analog Watchdog Out of Range Register for Precision Inputs (AWORR0) */

#define ADC_AWORR0_CWEN(n)                (1 << (n)) /* Bits 0-7: Analog Watchdog Out of Range for Precision Inputs (AWOR_CHn) */
                                                     /* Bits 8-31: Reserved */

/* Analog Watchdog Out of Range Register for Standard Inputs (AWORR1) */

#define ADC_AWORR1_CWEN(n)                (1 << (n)) /* Bits 0-23: Analog Watchdog Out of Range for Standard Inputs (AWOR_CHn) */
                                                     /* Bits 24-31: Reserved */

/* Analog Watchdog Out of Range Register for External Inputs (AWORR2) */

