apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
#define ADC_AWORR2_CWEN(n)                (1 << (n)) /* Bits 0-31: Analog Watchdog Out of Range for External Inputs (AWOR_CHn) */

/* Self-Test Configuration Register 1 (STCR1) */

                                                    /* Bits 0-7: Reserved */
#define ADC_STCR1_INPSAMP_S_SHIFT         (8)       /* Bits 8-15: Input Sampling Time Algorithm S (INPSAMP_S) */
#define ADC_STCR1_INPSAMP_S_MASK          (0xff << ADC_STCR1_INPSAMP_S_SHIFT)
                                                    /* Bits 16-23: Reserved */
#define ADC_STCR1_INPSAMP_C_SHIFT         (24)      /* Bits 24-31: Input Sampling Time Algorithm C (INPSAMP_C) */
#define ADC_STCR1_INPSAMP_C_MASK          (0xff << ADC_STCR1_INPSAMP_C_SHIFT)

/* Self-Test Configuration Register 2 (STCR2) */

#define ADC_STCR2_FMA_S                   (1 << 0)  /* Bit 0: Fault Mapping Algorithm S (FMA_S) */
                                                    /* Bit 1: Reserved */
#define ADC_STCR2_FMA_C                   (1 << 2)  /* Bit 2: Fault Mapping Algorithm C (FMA_C) */
#define ADC_STCR2_FMA_WDTERR              (1 << 3)  /* Bit 3: Fault Mapping Self-Test Watchdog Timer Error (FMA_WDTERR) */
#define ADC_STCR2_FMA_WDSERR              (1 << 4)  /* Bit 4: Fault Mapping Self-Test Watchdog Sequence Error (FMA_WDSERR) */
                                                    /* Bits 5-6: Reserved */
#define ADC_STCR2_EN                      (1 << 7)  /* Bit 7: Self-Test Enable (EN) */
                                                    /* Bits 8-10: Reserved */
#define ADC_STCR2_MSKERR_S0               (1 << 11) /* Bit 11: Mask Error Interrupt Algorithm S0 (MSKERR_S0) */
#define ADC_STCR2_MSKERR_S1               (1 << 12) /* Bit 12: Mask Error Interrupt Algorithm S1 (MSKERR_S1) */
#define ADC_STCR2_MSKERR_S2               (1 << 13) /* Bit 13: Mask Error Interrupt Algorithm S2 (MSKERR_S2) */
                                                    /* Bit 14: Reserved */
#define ADC_STCR2_MSKERR_C                (1 << 15) /* Bit 15: Mask Error Interrupt Algorithm C (MSKERR_C) */
#define ADC_STCR2_MSKWDG_EOA_S            (1 << 16) /* Bit 16: Mask Error Interrupt End Of Algorithm S (MSKWDG_EOA_S) */
                                                    /* Bit 17: Reserved */
#define ADC_STCR2_MSKWDG_EOA_C            (1 << 18) /* Bit 18: Mask Error Interrupt End Of Algorithm C (MSKWDG_EOA_C) */
                                                    /* Bits 19-22: Reserved */
#define ADC_STCR2_MSKST_EOC               (1 << 23) /* Bit 23: Mask Interrupt Self-Test End Of Conversion (MSKST_EOC) */
                                                    /* Bit 24: Reserved */
#define ADC_STCR2_MSKWDTERR               (1 << 25) /* Bit 25: Mask Interrupt Self-Test Watchdog Timer Error (MSKWDTERR) */
#define ADC_STCR2_SERR                    (1 << 26) /* Bit 26: Self-Test Error Injection (SERR) */
#define ADC_STCR2_MSKWDSERR               (1 << 27) /* Bit 27: Mask Interrupt Self-Test Watchdog Sequence Error (MSKWDSERR) */
                                                    /* Bits 28-31: Reserved */

/* Self-Test Configuration Register 3 (STCR3) */

#define ADC_STCR3_MSTEP_SHIFT             (0)       /* Bits 0-4: Algorithm Step (MSTEP) */
#define ADC_STCR3_MSTEP_MASK              (0x1f << ADC_STCR3_MSTEP_SHIFT)
                                                    /* Bits 5-7: Reserved */
#define ADC_STCR3_ALG_SHIFT               (8)       /* Bits 8-9: Algorithm Selection (ALG) */
#define ADC_STCR3_ALG_MASK                (0x03 << ADC_STCR3_ALG_SHIFT)
#  define ADC_STCR3_ALG_OSOM_ALGS_SS      (0x00 << ADC_STCR3_ALG_SHIFT) /* One-Shot Operation Mode: Algorithm S (Single Step = MSTEP) */
#  define ADC_STCR3_ALG_OSOM_ALGC_SS      (0x02 << ADC_STCR3_ALG_SHIFT) /* One-Shot Operation Mode: Algorithm C (Single Step = MSTEP) */
#  define ADC_STCR3_ALG_OSOM_ALGS         (0x03 << ADC_STCR3_ALG_SHIFT) /* One-Shot Operation Mode: Algorithm S (Default) */
#  define ADC_STCR3_ALG_CCM_ALGS          (0x00 << ADC_STCR3_ALG_SHIFT) /* Continuous Conversion Mode: Algorithm S */
#  define ADC_STCR3_ALG_CCM_ALGC          (0x02 << ADC_STCR3_ALG_SHIFT) /* Continuous Conversion Mode: Algorithm C */
#  define ADC_STCR3_ALG_CCM_ALGSS         (0x03 << ADC_STCR3_ALG_SHIFT) /* Continuous Conversion Mode: Algorithm S + Algorithm C (Default) */

                                                    /* Bits 10-31: Reserved */

/* Self-Test Baud Rate Register (STBRR) */

#define ADC_STBRR_BR_SHIFT                (0)       /* Bits 0-7: Baud Rate (BR) */
#define ADC_STBRR_BR_MASK                 (0xff << ADC_STBRR_BR_SHIFT)
                                                    /* Bits 8-15: Reserved */
#define ADC_STBRR_WDT_SHIFT               (16)      /* Bits 16-18: Self-Test Watchdog Timer (WDT) */
#define ADC_STBRR_WDT_MASK                (0x07 << ADC_STBRR_WDT_SHIFT)
#  define ADC_STBRR_WDT_8KCYC             (0x00 << ADC_STBRR_WDT_SHIFT) /*     8,192 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_39KCYC            (0x01 << ADC_STBRR_WDT_SHIFT) /*    39,936 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_78KCYC            (0x02 << ADC_STBRR_WDT_SHIFT) /*    79,872 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_156KCYC           (0x03 << ADC_STBRR_WDT_SHIFT) /*   159,744 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_391KCYC           (0x04 << ADC_STBRR_WDT_SHIFT) /*   400,384 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_781KCYC           (0x05 << ADC_STBRR_WDT_SHIFT) /*   799,744 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_1562KCYC          (0x06 << ADC_STBRR_WDT_SHIFT) /* 1,599,488 Conversion Clock Cycles */
#  define ADC_STBRR_WDT_3906KCYC          (0x07 << ADC_STBRR_WDT_SHIFT) /* 3,999,744 Conversion Clock Cycles */

                                                    /* Bits 19-31: Reserved */

/* Self-Test Status Register 1 (STSR1) */

                                                    /* Bits 0-4: Reserved */
#define ADC_STSR1_STEP_C_SHIFT            (5)       /* Bits 5-9: Step Of Algorithm C (STEP_C) */
#define ADC_STSR1_STEP_C_MASK             (0x1f << ADC_STSR1_STEP_C_SHIFT)
                                                    /* Bit 10: Reserved */
#define ADC_STSR1_ERR_S0                  (1 << 11) /* Bit 11: Error Algorithm S Step 0 (ERR_S0) */
#define ADC_STSR1_ERR_S1                  (1 << 12) /* Bit 12: Error Algorithm S Step 1 (ERR_S1) */
#define ADC_STSR1_ERR_S2                  (1 << 13) /* Bit 13: Error Algorithm S Step 2 (ERR_S2) */
                                                    /* Bit 14: Reserved */
#define ADC_STSR1_ERR_C                   (1 << 15) /* Bit 15: Error Algorithm C (ERR_C) */
#define ADC_STSR1_WDG_EOA_S               (1 << 16) /* Bit 16: Self-Test Watchdog End Of Algorithm S (WDG_EOA_S) */
                                                    /* Bit 17: Reserved */
#define ADC_STSR1_WDG_EOA_C               (1 << 18) /* Bit 18: Self-Test Watchdog End Of Algorithm C (WDG_EOA_C) */
                                                    /* Bit 19-22: Reserved */
#define ADC_STSR1_ST_EOC                  (1 << 23) /* Bit 23: Self-Test End Of Conversion (ST_EOC) */
#define ADC_STSR1_OVERWR                  (1 << 24) /* Bit 24: Self-Test Error Status Overwrite (OVERWR) */
#define ADC_STSR1_WDTERR                  (1 << 25) /* Bit 25: Self-Test Watchdog Timer Error (WDTERR) */
                                                    /* Bit 26: Reserved */
#define ADC_STSR1_WDSERR                  (1 << 27) /* Bit 27: Self-Test Watchdog Sequence Error (WDSERR) */
                                                    /* Bit 28-31: Reserved */

/* Self-Test Status Register 2 (STSR2) */

#define ADC_STSR2_DATA0_SHIFT             (0)       /* Bits 0-14: Conversion Data ERR_S1 (DATA0) */
#define ADC_STSR2_DATA0_MASK              (0x7fff << ADC_STSR2_DATA0_SHIFT)
                                                    /* Bits 15-31: Reserved */

