apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_adc.h
/* Self-Test Status Register 3 (STSR3) */

#define ADC_STSR3_DATA0_SHIFT             (0)       /* Bits 0-14: Conversion Data ERR_S0 (DATA0) */
#define ADC_STSR3_DATA0_MASK              (0x7fff << ADC_STSR3_DATA0_SHIFT)
                                                    /* Bit 15: Reserved */
#define ADC_STSR3_DATA1_SHIFT             (16)      /* Bits 16-30: Conversion Data ERR_S2 (DATA1) */
#define ADC_STSR3_DATA1_MASK              (0x7fff << ADC_STSR3_DATA1_SHIFT)
                                                    /* Bit 31: Reserved */

/* Self-Test Status Register 4 (STSR4) */

                                                    /* Bits 0-15: Reserved */
#define ADC_STSR4_DATA1_SHIFT             (16)      /* Bits 16-30: Conversion Data ERR_C (DATA1) */
#define ADC_STSR4_DATA1_MASK              (0x7fff << ADC_STSR4_DATA1_SHIFT)
                                                    /* Bit 31: Reserved */

/* Self-Test Conversion Data Register 1 (STDR1) */

#define ADC_STDR1_TCDATA_SHIFT            (0)       /* Bits 0-14: Test Channel Conversion Data (TCDATA) */
#define ADC_STDR1_TCDATA_MASK             (0x7fff << ADC_STDR1_TCDATA_SHIFT)
                                                    /* Bits 15-17: Reserved */
#define ADC_STDR1_OVERWR                  (1 << 18) /* Bit 18: Conversion Data Overwrite Status (OVERWR) */
#define ADC_STDR1_VALID                   (1 << 19) /* Bit 19: Valid Conversion Data (VALID) */
                                                    /* Bits 20-31: Reserved */

/* Self-Test Analog Watchdog S0 Register (STAW0R) */

#define ADC_STAW0R_THRL_SHIFT             (0)       /* Bits 0-14: Lower Threshold Value (THRL) */
#define ADC_STAW0R_THRL_MASK              (0x7fff << ADC_STAW0R_THRL_SHIFT)
                                                    /* Bit 15: Reserved */
#define ADC_STAW0R_THRH_SHIFT             (16)      /* Bits 16-29: Higher Threshold Value (THRH) */
#define ADC_STAW0R_THRH_MASK              (0x3fff << ADC_STAW0R_THRH_SHIFT)
#define ADC_STAW0R_WDTE                   (1 << 30) /* Bit 30: Self-Test Watchdog Timer Enable (WDTE) */
#define ADC_STAW0R_AWDE                   (1 << 31) /* Bit 31: Self-Test Watchdog Enable (AWDE) */

/* Self-Test Analog Watchdog S1 Register (STAW1R) */

#define ADC_STAW1R_THRL_SHIFT             (0)       /* Bits 0-14: Lower Threshold Value (THRL) */
#define ADC_STAW1R_THRL_MASK              (0x7fff << ADC_STAW1R_THRL_SHIFT)
                                                    /* Bits 15-30: Reserved */
#define ADC_STAW1R_AWDE                   (1 << 31) /* Bit 31: Self-Test Watchdog Enable (AWDE) */

/* Self-Test Analog Watchdog S2 Register (STAW2R) */

#define ADC_STAW2R_THRL_SHIFT             (0)       /* Bits 0-14: Lower Threshold Value (THRL) */
#define ADC_STAW2R_THRL_MASK              (0x7fff << ADC_STAW2R_THRL_SHIFT)
                                                    /* Bits 15-30: Reserved */
#define ADC_STAW2R_AWDE                   (1 << 31) /* Bit 31: Self-Test Watchdog Enable (AWDE) */

/* Self-Test Analog Watchdog C0 Register (STAW4R) */

#define ADC_STAW4R_THRL_SHIFT             (0)       /* Bits 0-14: Lower Threshold Value (THRL) */
#define ADC_STAW4R_THRL_MASK              (0x7fff << ADC_STAW4R_THRL_SHIFT)
                                                    /* Bit 15: Reserved */
#define ADC_STAW4R_THRH_SHIFT             (16)      /* Bits 16-29: Higher Threshold Value (THRH) */
#define ADC_STAW4R_THRH_MASK              (0x3fff << ADC_STAW4R_THRH_SHIFT)
#define ADC_STAW4R_WDTE                   (1 << 30) /* Bit 30: Self-Test Watchdog Timer Enable (WDTE) */
#define ADC_STAW4R_AWDE                   (1 << 31) /* Bit 31: Self-Test Watchdog Enable (AWDE) */

/* Self-Test Analog Watchdog C Register (STAW5R) */

#define ADC_STAW5R_THRL_SHIFT             (0)       /* Bits 0-14: Lower Threshold Value (THRL) */
#define ADC_STAW5R_THRL_MASK              (0x7fff << ADC_STAW5R_THRL_SHIFT)
                                                    /* Bit 15: Reserved */
#define ADC_STAW5R_THRH_SHIFT             (16)      /* Bits 16-30: Higher Threshold Value (THRH) */
#define ADC_STAW5R_THRH_MASK              (0x7fff << ADC_STAW5R_THRH_SHIFT)
                                                    /* Bit 31: Reserved */

/* Analog Miscellaneous In/Out Register (AMSIO) */

                                                    /* Bits 0-16: Reserved */
#define ADC_AMSIO_HSEN_SHIFT              (17)      /* Bits 17-18: High-Speed Enable (HSEN) */
#define ADC_AMSIO_HSEN_MASK               (0x03 << ADC_AMSIO_HSEN_SHIFT)
#  define ADC_AMSIO_HSEN_NS               (0x00 << ADC_AMSIO_HSEN_SHIFT) /* Normal Conversion Speed */
#  define ADC_AMSIO_HSEN_HS               (0x03 << ADC_AMSIO_HSEN_SHIFT) /* High-Speed Conversion */

                                                    /* Bits 19-31: Reserved */

/* Control and Calibration Status Register (CALBISTREG) */

#define ADC_CALBISTREG_TEST_EN            (1 << 0)  /* Bit 0: Calibration Enable (TEST_EN) */
                                                    /* Bits 1-2: Reserved */
#define ADC_CALBISTREG_TEST_FAIL          (1 << 3)  /* Bit 3: Calibration Status (TEST_FAIL) */
#define ADC_CALBISTREG_AVG_EN             (1 << 4)  /* Bit 4: Calibration Averaging Enable (AVG_EN) */
#define ADC_CALBISTREG_NR_SMPL_SHIFT      (5)       /* Bits 5-6: Calibration Averaging Number (NR_SMPL) */
#define ADC_CALBISTREG_NR_SMPL_MASK       (0x03 << ADC_CALBISTREG_NR_SMPL_SHIFT)
#  define ADC_CALBISTREG_NR_SMPL_4SMPL    (0x00 << ADC_CALBISTREG_NR_SMPL_SHIFT) /*  4 Samples */
#  define ADC_CALBISTREG_NR_SMPL_8SMPL    (0x01 << ADC_CALBISTREG_NR_SMPL_SHIFT) /*  8 Samples */
#  define ADC_CALBISTREG_NR_SMPL_16SMPL   (0x02 << ADC_CALBISTREG_NR_SMPL_SHIFT) /* 16 Samples */
#  define ADC_CALBISTREG_NR_SMPL_32SMPL   (0x03 << ADC_CALBISTREG_NR_SMPL_SHIFT) /* 32 Samples */

                                                    /* Bits 7-13: Reserved */
#define ADC_CALBISTREG_CALSTFUL           (1 << 14) /* Bit 14: Calibration and Self-Test Full Range Comparison (CALSTFUL) */
#define ADC_CALBISTREG_C_T_BUSY           (1 << 15) /* Bit 15: Calibration Busy (C_T_BUSY) */
                                                    /* Bits 16-26: Reserved */
#define ADC_CALBISTREG_TSAMP_SHIFT        (27)      /* Bits 27-28: Sample Period in Calibration (TSAMP) */
#define ADC_CALBISTREG_TSAMP_MASK         (0x03 << ADC_CALBISTREG_TSAMP_SHIFT)
#  define ADC_CALBISTREG_TSAMP_22CYC      (0x00 << ADC_CALBISTREG_TSAMP_SHIFT) /* 22 Conversion Clock Cycles */
#  define ADC_CALBISTREG_TSAMP_8CYC       (0x01 << ADC_CALBISTREG_TSAMP_SHIFT) /*  8 Conversion Clock Cycles */
#  define ADC_CALBISTREG_TSAMP_16CYC      (0x02 << ADC_CALBISTREG_TSAMP_SHIFT) /* 16 Conversion Clock Cycles */
#  define ADC_CALBISTREG_TSAMP_32CYC      (0x03 << ADC_CALBISTREG_TSAMP_SHIFT) /* 32 Conversion Clock Cycles */

#define ADC_CALBISTREG_RESN_SHIFT         (29)      /* Bits 29-31: Conversion Resolution (RESN) */
#define ADC_CALBISTREG_RESN_MASK          (0x07 << ADC_CALBISTREG_RESN_SHIFT)
#  define ADC_CALBISTREG_RESN_14BIT       (0x00 << ADC_CALBISTREG_RESN_SHIFT) /* 14-Bit Resolution */
#  define ADC_CALBISTREG_RESN_12BIT       (0x01 << ADC_CALBISTREG_RESN_SHIFT) /* 12-Bit Resolution */
#  define ADC_CALBISTREG_RESN_10BIT       (0x02 << ADC_CALBISTREG_RESN_SHIFT) /* 10-Bit Resolution */
#  define ADC_CALBISTREG_RESN_8BIT        (0x03 << ADC_CALBISTREG_RESN_SHIFT) /*  8-Bit Resolution */

/* Offset and Gain User Register (OFSGNUSR) */

#define ADC_OFSGNUSR_OFFSET_USER_SHIFT    (0)       /* Bits 0-7: Offset User (OFFSET_USER) */
#define ADC_OFSGNUSR_OFFSET_USER_MASK     (0xff << ADC_OFSGNUSR_OFFSET_USER_SHIFT)
                                                    /* Bits 8-15: Reserved */
#define ADC_OFSGNUSR_GAIN_USER_SHIFT      (0)       /* Bits 16-25: Gain User (GAIN_USER) */
#define ADC_OFSGNUSR_GAIN_USER_MASK       (0x03ff << ADC_OFSGNUSR_GAIN_USER_SHIFT)
                                                    /* Bits 26-31: Reserved */

/* Calibration Value 2 (CAL2) */

                                                    /* Bits 0-14: Reserved */
#define ADC_CAL2_ENX                      (1 << 15) /* Bit 15: Enable X (ENX) */
                                                    /* Bits 16-31: Reserved */

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_ADC_H */
